{
	"category_full_form": "Программист_Backend разработчик_Разработка API_SOAP",
	"category_human_form": "Backend разработчик_SOAP",
	"category_filename_form": "программист_backend-разработчик_разработка-api_soap",
	"questions": [
		{
			"question": "Что такое SOAP?",
			"right_answer": "SOAP означает простой протокол доступа к объектам - это тип протокола связи, способ структурирования данных перед их передачей и основан на стандарте XML. Он разработан для обеспечения связи между приложениями разных платформ и языков программирования через интернет. Он может использовать ряд протоколов, таких как FTP, HTTP, SMTP, протокол почтового отделения 3 (POP3) для передачи документов. Другими словами, это протокол на основе XML для передачи данных между компьютерами."
		},
		{
			"question": "Укажите, какой формат сообщения используется в SOAP?",
			"right_answer": "Формат сообщения написан с использованием языка XML. Формат сообщения является стандартным и широко используется."
		},
		{
			"question": "Перечислите важные характеристики элемента SOAP-оболочки?",
			"right_answer": "Характеристика элемента SOAP:\n\nСообщение SOAP имеет корневой элемент Envelope\nEnvelope является обязательной частью сообщения SOAP\nЕсли Envelope содержит элемент заголовка, то их не должно быть более одного. Кроме того, он должен появляться как первый дочерний элемент Envelope\nКогда меняется версия SOAP, меняется и версия оболочки\nSOAP-оболочка указывается префиксом ENV и элементом Envelope\nОпциональное кодирование SOAP также указывается с использованием пространства имен и опционального элемента encodingstyle"
		},
		{
			"question": "Укажите, каков формат ответа для ответа SOAP?",
			"right_answer": "Ответ SOAP будет выглядеть примерно так\n\nHTTP/1.0 200 OK\nContent Type: text/xml; charset=utf-8\nContent-Length: nnn\n<?xml version= “1.0”?>\n<SOAP-ENV:Envelop\nxmlns: SOAP-ENV= http://www.guru99.org/2003/05/soap-envelope”\nSOAP-ENV: encoding style= http://www.guru99.org/2003/05/soap-encoding>\n<SOAP-ENV: Body xmlns:m=http://www.xyz.org/quotation”>\n<m:GetQuotationResponse>\n<m:Quotation > Here is the Quotation</m:Quotation>\n</m:QuotationRequest>\n</SOAP-ENV:Body>\n</SOAP-ENV: Envelope>"
		},
		{
			"question": "Что такое элемент SOAP-оболочки?",
			"right_answer": "SOAP-оболочка указывает начало и конец сообщения, чтобы получатель знал, когда было получено целое сообщение. Другими словами, SOAP-оболочка - это механизм упаковки."
		},
		{
			"question": "Укажите, какой метод транспортировки используется в SOAP?",
			"right_answer": "SOAP использует прикладной и транспортный уровни сети. HTTP и SMTP являются допустимыми протоколами прикладного уровня, используемыми в качестве транспорта для SOAP. HTTP предпочтительнее, так как он хорошо работает с текущей интернет-инфраструктурой, особенно с брандмауэрами. Запросы SOAP могут быть отправлены с помощью метода HTTP GET, в то время как спецификация включает подробности только о HTTP POST."
		},
		{
			"question": "Как пользователь использует предоставленные средства SOAP?",
			"right_answer": "PutAddress(): Используется для ввода адреса на веб-странице. Он передает экземпляр адреса в вызов SOAP\nPutListing(): Используется для вставки полного XML-документа на веб-страницу. Он получает XML-файл в качестве аргумента и передает XML-файл в связь с парсером XML, который считывает его и помещает его в параметр вызова SOAP\nGetAddress(): Используется для определения имени запроса и извлечения результата, который лучше всего соответствует запросу. В виде текстовой строки имя отправляется в вызов SOAP\nGetAllListing(): Используется для возврата полного списка в формате XML."
		},
		{
			"question": "Укажите, с каким основным препятствием сталкиваются пользователи, использующие SOAP?",
			"right_answer": "Основным препятствием, с которым сталкиваются пользователи, использующие SOAP, является механизм безопасности брандмауэра. Он блокирует все порты, оставляя лишь несколько, таких как HTTP-порт 80 и HTTP-порт, используемый SOAP, который обходит брандмауэр. Технические жалобы на SOAP заключаются в том, что он смешивает спецификацию для передачи сообщений с спецификацией для структуры сообщений."
		},
		{
			"question": "Укажите, в чем разница между веб-сервисом и SOA?",
			"right_answer": "SOA - это принцип проектирования программного обеспечения и архитектурный шаблон для реализации слабо связанных, повторно используемых и крупнозернистых сервисов. С использованием любых протоколов, таких как HTTP, HTTPS, JMS, SMTP и т. д., вы можете реализовать SOA. Сообщение может быть в объектах передачи данных или в XML. В то время как веб-сервис - это технология реализации и один из способов реализации SOA."
		},
		{
			"question": "Укажите, что такое привязка SOAP HTTP?",
			"right_answer": "HTTP работает поверх TCP/IP. Клиент HTTP соединяется с сервером HTTP с использованием TCP. SOAP HTTP - это метод, который соответствует правилам кодирования SOAP. HTTP + XML = SOAP. Запрос SOAP может быть HTTP GET запросом или HTTP POST запросом. HTTP POST запрос содержит как минимум два HTTP заголовка: Content-Type и Content-Length."
		},
		{
			"question": "Укажите, что такое конечная точка в веб-сервисах?",
			"right_answer": "IP-адрес сервера, на котором работают веб-сервисы, является конечной точкой в веб-сервисах."
		},
		{
			"question": "Укажите, в чем разница между SOAP и другими техниками удаленного доступа?",
			"right_answer": "SOAP Webservice предоставляет удобную платформу с независимостью от языка, использует протокол HTTP и сохраняет данные в формате XML. Объекты SOAP являются безсостоятельными и сложными в обслуживании. Другие веб-сервисы, такие как DCOM или CORBA, более популярны, но более сложны."
		},
		{
			"question": "Укажите, в чем разница между веб-сервисом SOAP и веб-сервисом RESTful?",
			"right_answer": "SOAP: В SOAP, общение между клиентом и веб-сервисом происходит с использованием XML-сообщения. Он определяет правила общения, такие как какие теги должны использоваться в XML и их значение. RESTful: Он использует архитектуру, которая использует HTTP или аналогичные протоколы, ограничивая интерфейс использованием стандартных операций, таких как GET, PUT, POST, DELETE для HTTP."
		},
		{
			"question": "Укажите, в чем разница между JSON и SOAP?",
			"right_answer": "JSON - это стандарт для представления читаемых человеком данных. SOAP - это требование протокола для передачи информации и вызова веб-сервисов с использованием XML."
		}
	]
}
