{
	"category_full_form": "Программист_DevOps инженер_Безопасность в DevOps (DevSecOps)",
	"category_human_form": "DevOps инженер_Безопасность в DevOps (DevSecOps)",
	"category_filename_form": "программист_devops-инженер_безопасность-в-devops-devsecops",
	"questions": [
		{
			"question": "Что такое DevSecOps?",
			"right_answer": "DevSecOps - это подход к разработке программного обеспечения, который объединяет практики DevOps и безопасности. Цель DevSecOps - интеграция безопасности в жизненный цикл разработки, а не рассматривание ее как послепродажное обслуживание. Компании все чаще ищут инженеров DevSecOps для руководства своими усилиями в области безопасности."
		},
		{
			"question": "Каковы некоторые преимущества SAST в процессе DevSecOps?",
			"right_answer": "SAST - одна из очень важных неотъемлемых частей процесса DevSecOps. Если проводить ее на ранней стадии разработки, SAST может помочь обнаружить возможные уязвимости, которые могут быть устранены после компиляции или выполнения кода. Это экономит время и другие ресурсы, потому что позднее обнаружение уязвимостей в процессе разработки обычно требует много работы или даже переписывания кода с нуля. Кроме того, начать работу с SAST просто, поскольку она выполняет как анализ потока данных, так и анализ потока управления."
		},
		{
			"question": "Какова цель проведения анализа рисков в R при тестировании?",
			"right_answer": "Анализ рисков выявляет и смягчает безопасностные риски при разработке дизайна."
		},
		{
			"question": "Как вы обеспечиваете защиту секретов в своем конвейере DevSecOps?",
			"right_answer": "Для обеспечения защиты секретов в конвейере DevSecOps можно использовать следующие методы: Внедрение платформы управления секретами, такой как HashiCorp Vault или Ansible Vault, которая сохраняет секреты в частном порядке, обеспечивает доступ к ним и управляется с использованием контроля доступа на основе идентификации. Создание зашифрованных значений для секретов, таких как ключи API, токены, сертификаты и учетные данные базы данных, хранение которых производится вручную или в хранилище управления исходным кодом. Разделение чувствительных ресурсов на различные среды, а затем применение принципов минимальных привилегий, например, запрет использования привилегированного доступа или привилегированных разрешений и т. д."
		},
		{
			"question": "Как разработчики могут тестировать и исправлять уязвимости в своих приложениях?",
			"right_answer": "Разработчики могут тестировать и исправлять уязвимости приложений, изучая код, выявляя уязвимости и применяя безопасные практики кодирования. Они могут использовать инструменты, такие как уязвимые демонстрационные приложения, для моделирования попыток взлома и улучшения своего уровня безопасности."
		},
		{
			"question": "Почему пошаговое планирование необходимо при внедрении мер безопасности?",
			"right_answer": "Пошаговое планирование необходимо для того, чтобы обеспечить возможность веб-инженерам эффективно управлять мерами безопасности и предоставлять советы по смягчению на ранних этапах жизненного цикла SLC."
		},
		{
			"question": "Почему безопасность важна в DevOps (DevSecOps)?",
			"right_answer": "Безопасность критична в DevOps (DevSecOps), чтобы гарантировать, что меры безопасности интегрированы в процессы разработки и эксплуатации с самого начала, а не добавляются как послеумышленное дополнение."
		},
		{
			"question": "Почему важно интегрировать безопасность?",
			"right_answer": "Интеграция безопасности необходима для того, чтобы завоевать доверие заинтересованных сторон, обеспечить безопасность данных и обеспечить безопасный переход в облако."
		},
		{
			"question": "Как вы обеспечиваете выполнение требований соответствия в среде DevSecOps?",
			"right_answer": "Требования соответствия могут быть выполнены в среде DevSecOps путем реализации следующего: Автоматизированные проверки соответствия в виде кода в конвейере CI/CD, Автоматизированная документация соответствия с использованием инструментов, таких как Chef Compliance или InSpec, Непрерывное управление соответствием путем интеграции проверки соответствия в непрерывное мониторинг, Безопасность и соответствие в виде кода путем автоматической настройки, обеспечения безопасности и тестирования конфигураций и операций, Непрерывная оценка соответствия с использованием инструментов, таких как Aqua Security, который предоставляет комплексный подход, объединяющий как DevOps, так и аспекты безопасности."
		},
		{
			"question": "В чем разница между сканированием уязвимостей и тестированием на проникновение?",
			"right_answer": "Сканирование уязвимостей - это автоматизированный подход, который сканирует и оценивает системы и приложения на наличие технических слабостей и уязвимостей. Тестирование на проникновение включает в себя этические методы хакерства с использованием человеческого интеллекта для имитации атак в реальном мире, выявления потенциальных уязвимостей и оценки эффективности существующих мер безопасности."
		},
		{
			"question": "Почему важно логирование в DevSecOps?",
			"right_answer": "Логирование имеет огромное значение в DevSecOps, потому что оно записывает действия и характер действий, происходящих в системе. Эта информация доступна для обнаружения угроз безопасности, обнаружения аномалий и, наконец, для реагирования на инциденты безопасности вовремя. Правильное управление журналами также помогает реагировать на требования регулирования соответствия, такие как PCI-DSS, HIPAA и GDPR."
		},
		{
			"question": "В чем разница между моделированием угроз и оценкой рисков?",
			"right_answer": "Моделирование угроз включает в себя выявление потенциальных угроз и уязвимостей в приложении или системе. В отличие от этого, оценка рисков оценивает серьезность и вероятность выявленных рисков, сосредотачиваясь на понимании их общих последствий пропорциональным образом."
		}
	]
}
