{
	"category_full_form": "Программист_Full Stack разработчик_Backend часть_Ruby + Ruby on Rails",
	"category_human_form": "Full Stack разработчик_Ruby + Ruby on Rails",
	"category_filename_form": "программист_full-stack-разработчик_backend-часть_ruby-ruby-on-rails",
	"questions": [
		{
			"question": "Как сообщество Ruby решает проблемы производительности веб-фреймворков по сравнению с другими языками?",
			"right_answer": "Сообщество Ruby решает проблемы производительности путем оптимизации ядра Ruby, принятия компиляции JIT и улучшения производительности популярных фреймворков, таких как Ruby on Rails. Инструменты, такие как 'JRuby' (Ruby на Java Virtual Machine) и 'TruffleRuby', направлены на улучшение производительности Ruby, делая его более конкурентоспособным в веб-разработке."
		},
		{
			"question": "В чем разница между методами 'dup' и 'clone'?",
			"right_answer": "Методы dup и clone в Ruby используются для создания копий объектов, но они отличаются в том, как они обрабатывают определенные аспекты. Метод dup создает поверхностную копию объекта, копируя переменные экземпляра объекта, но не его замороженное состояние или одиночные методы. С другой стороны, метод clone создает более глубокую копию, дублируя замороженное состояние и одиночные методы. Это означает, что клон более тщательно воспроизводит характеристики объекта."
		},
		{
			"question": "Объясните концепцию непрерывной интеграции и непрерывного развертывания (CI/CD).",
			"right_answer": "Непрерывная интеграция (CI) и непрерывное развертывание (CD) - это практики разработки, которые включают в себя автоматизацию и оптимизацию процесса создания, тестирования и развертывания программного обеспечения. CI фокусируется на автоматическом интегрировании изменений кода от нескольких разработчиков в общий репозиторий. При каждой новой загрузке кода запускаются автоматизированные тесты, чтобы своевременно выявить проблемы интеграции. CD идет дальше. Он автоматически разворачивает код в производственные или тестовые среды на основе успешной CI. Это быстрое и автоматизированное развертывание гарантирует, что новые функции и исправления ошибок доставляются пользователям как можно быстрее и надежнее."
		},
		{
			"question": "Как создать и опубликовать свой собственный Ruby Gem?",
			"right_answer": "Для создания и публикации Ruby Gem вам нужно выполнить следующие шаги: Создать файл gemspec, описывающий ваш gem. Написать код вашего gem и структурировать его в соответствии с соглашениями. Использовать команду 'gem build' для создания файла gem из вашего gemspec. Использовать 'gem push' для публикации вашего gem на RubyGems.org, центральном репозитории gem. Этот процесс позволяет вам делиться вашим кодом и библиотеками с другими участниками сообщества Ruby."
		},
		{
			"question": "Обсудите концепцию усовершенствований в Ruby.",
			"right_answer": "Усовершенствования - это механизм в Ruby, который позволяет вам временно изменять поведение классов в определенной лексической области без влияния на глобальное поведение. Они особенно полезны для предотвращения непреднамеренных последствий при глобальном изменении классов. Усовершенствования часто используются для создания более надежных и изолированных изменений в классах, обеспечивая ограничение модификаций в заданной области."
		},
		{
			"question": "Как можно создать пользовательский DSL (язык, специфичный для области) на Ruby?",
			"right_answer": "Создание пользовательского DSL на Ruby включает в себя определение методов и структур, которые обеспечивают более выразительный и читаемый синтаксис для конкретной области проблем. Это часто включает использование блоков или других конструкций для инкапсуляции и настройки поведения. Создавая свой API и предоставляя методы, которые тесно напоминают естественные языковые конструкции, вы можете создать DSL, который кажется созданным под конкретный случай использования. Это делает код более интуитивно понятным и поддерживаемым."
		},
		{
			"question": "Объясните концепцию fibers и их использование в управлении легковесными параллельными задачами.",
			"right_answer": "Fibers - это механизм легковесной параллельности в Ruby, который позволяет приостанавливать и возобновлять выполнение блока кода. Они обеспечивают способ достижения кооперативного многозадачности, где один поток может управлять несколькими независимыми контекстами выполнения. Fibers полезны в ситуациях, когда требуется выполнение операций ввода-вывода без блокировки всего потока. Они обеспечивают уровень параллелизма без ограничений глобального замка интерпретатора (GIL)."
		},
		{
			"question": "Объясните роль Bundler и гемов в экосистеме Ruby.",
			"right_answer": "Bundler - это инструмент, используемый в экосистеме Ruby для управления зависимостями гемов в проектах. Он поддерживает 'Gemfile', в котором перечислены необходимые гемы вместе с их версиями. Он гарантирует, что правильные версии гемов установлены и что нет конфликтов версий, обеспечивая последовательную среду для приложений на разных машинах. Гемы, с другой стороны, являются пакетами, которые инкапсулируют повторно используемый код и библиотеки, упрощая процесс внедрения функциональности в проекты Ruby."
		},
		{
			"question": "Обсудите подход Ruby к многопоточности и параллелизму.",
			"right_answer": "Ruby реализует глобальный замок интерпретатора (GIL), который ограничивает выполнение нескольких нативных потоков параллельно в пределах одного процесса Ruby. Хотя это ограничение мешает реальной параллельности для задач, связанных с ЦП, Ruby использует нативные потоки для операций, связанных с вводом-выводом."
		},
		{
			"question": "Объясните потенциальное влияние WebAssembly на разработку на Ruby.",
			"right_answer": "WebAssembly (Wasm) - это бинарный формат инструкций, который позволяет запускать код, написанный на нескольких языках, в веб-браузерах. Это потенциально может позволить запускать код Ruby непосредственно в веб-браузерах, открывая новые возможности для веб-приложений. Это может привести к более сложным и интерактивным веб-опытам с компонентами, работающими на Ruby, хотя практические проблемы реализации и соображения по производительности должны быть учтены."
		},
		{
			"question": "Обсудите глобальный блокировщик интерпретатора (GIL) и его влияние на производительность Ruby.",
			"right_answer": "Глобальный блокировщик интерпретатора (GIL) - это мьютекс в интерпретаторе CPython (основная реализация Ruby), который предотвращает одновременное выполнение нескольких нативных потоков Python (или Ruby) в одном процессе. Это означает, что даже на многоядерных системах только один поток может выполнять код Ruby одновременно. GIL может ограничить потенциальные выигрыши в производительности при использовании нескольких ядер ЦП для определенных видов нагрузки, связанных с задачами, требующими большой вычислительной мощности."
		},
		{
			"question": "Как Ruby решает проблемы, возникшие в связи с ростом архитектуры микросервисов?",
			"right_answer": "Принятие микросервисов Ruby облегчается фреймворками типа Hanami и Roda, которые предоставляют легкие и модульные структуры, подходящие для микросервисов. Контейнеризация и инструменты оркестрации, такие как Docker и Kubernetes, также помогают эффективно развертывать и управлять микросервисами Ruby, способствуя адаптации экосистемы к архитектуре микросервисов."
		},
		{
			"question": "Как Ruby используется в разработке кросс-платформенных мобильных приложений?",
			"right_answer": "Ruby, с помощью фреймворка RubyMotion, позволяет разработчикам создавать кросс-платформенные мобильные приложения для iOS, Android и macOS, используя единую кодовую базу. RubyMotion использует преимущества синтаксиса Ruby, позволяя разработчикам создавать нативные мобильные приложения без излишнего платформенно-специфичного кода."
		}
	]
}
