{
    "category_full_form": "Программист_Мобильный разработчик_iOS_Swift",
    "category_human_form": "Мобильный разработчик_Swift",
    "category_filename_form": "программист_мобильный-разработчик_ios_swift",
    "questions": [
        {
            "question": "Что такое кортеж? Как создать кортеж в swift?",
            "right_answer": "Кортеж - это группа различных значений в одном составном значении. Это упорядоченный список элементов. Есть два способа доступа к данным объекта в кортеже, т.е. по имени или по позиции. В swift кортеж может состоять из нескольких различных типов. Он может содержать два значения, одно целочисленного типа, а другое строкового типа. Это допустимая команда. Например: let ImplementationError = (501, “Not implemented”). Мы можем создать базовый кортеж таким образом: let person = (name: “Ajay” , age: 34)"
        },
        {
            "question": "Какое назначение у двойного вопросительного знака «??» в Swift?",
            "right_answer": "Двойной вопросительный знак «??» является оператором объединения с nil, это в основном является сокращением для тернарного условного оператора, где мы используем проверку на nil. Двойной вопросительный знак также используется для предоставления значения по умолчанию для переменной. stringVar ?? “default string” Это именно то, что делает обычное действие, если stringVar не nil, то оно возвращается, в противном случае возвращается «default string»."
        },
        {
            "question": "Какие типы объектов являются базовыми типами данных в Swift?",
            "right_answer": "Swift использует стандартный набор базовых типов данных для различных целей, таких как логические значения, числа и строки."
        },
        {
            "question": "Что такое модуль Swift?",
            "right_answer": "Модуль - это единица распространения кода. Фреймворк или приложение создаются и поставляются как единое целое, которое может быть импортировано другим модулем с помощью ключевого слова swift import. Каждая цель сборки в инструменте Xcode рассматривается как отдельный модуль в Swift."
        },
        {
            "question": "Что такое протокол в Swift?",
            "right_answer": "Протокол - очень распространенная особенность языка программирования Swift, и протокол - это концепция, аналогичная интерфейсу из Java. Протокол определяет чертеж свойств, методов и других требований, которые подходят для определенной задачи. В своей простейшей форме протокол - это интерфейс, который описывает некоторые методы и свойства. Протокол просто описывает скелет свойств или методов, а не их реализацию. Реализацию свойств и методов можно выполнить, определив перечисления, функции и классы. Протоколы объявляются после имен структуры, перечисления или класса. Возможно объявление одного или нескольких протоколов. Несколько протоколов разделяются запятыми. Мы можем определить протокол таким образом, что он очень похож на структуры, перечисления и классы."
        },
        {
            "question": "Что такое 'defer'?",
            "right_answer": "'Defer' - это ключевое слово, которое предоставляет блок кода, который может быть выполнен при выходе выполнения из текущей области видимости."
        },
        {
            "question": "Объясните Grand Central Dispatch (GDC).",
            "right_answer": "GCD (Grand Central Dispatch) - это низкоуровневый API для управления параллельными операциями. Этот концепт используется для улучшения производительности приложения. Этот процесс используется для управления несколькими задачами одновременно. Grand Central Dispatch (GCD) является наиболее полезным API для многозадачности с асинхронным и синхронным программированием в iOS."
        },
        {
            "question": "Что такое PLIST в iOS?",
            "right_answer": "PLIST означает Property List. PLIST в основном представляет собой словарь значений и ключей, которые могут быть сохранены в нашей файловой системе с расширением файла .plist. Свойственный список используется в качестве портативного и легкого средства для хранения небольшого объема данных. Обычно они записываются в формате XML."
        },
        {
            "question": "В чем разница между Array и NSArray?",
            "right_answer": "Разница между Array и NSArray заключается в следующем: Массив может содержать только один тип данных, в то время как NSArray может содержать разные типы данных. Массив является типом значения, в то время как NSArray является неизменяемым типом ссылки."
        },
        {
            "question": "Какие элементы источника использует Xcode?",
            "right_answer": "Xcode использует четыре различных типа элементов источника, как указано ниже: Framework, Source Group, Source File, Source Folder"
        },
        {
            "question": "Какой JSON-фреймворк поддерживается iOS?",
            "right_answer": "Фреймворк SBJson поддерживается iOS. Фреймворк SBJson предоставляет дополнительное управление и гибкий API, что облегчает обработку JSON. Это хороший и очень гибкий фреймворк, который поддерживает гибкое функционирование API."
        },
        {
            "question": "Как мы можем определить базовый класс в Swift?",
            "right_answer": "В языке программирования Swift классы не наследуются от базового класса. Классы определяются разработчиком без указания суперкласса, и он автоматически становится базовым классом."
        },
        {
            "question": "Объясните Core Data.",
            "right_answer": "Core Data - один из самых мощных фреймворков, предоставленных Apple для приложений macOS и iOS. Core Data используется для обработки объектов уровня модели в наших приложениях. Мы можем рассматривать Core Data как фреймворк для фильтрации, модификации, сохранения и отслеживания данных в приложениях iOS. Core Data не является реляционной базой данных. Используя Core Data, мы можем легко сопоставлять объекты в нашем приложении с записями таблиц в базе данных, не зная SQL. Core Data - это M в структуре MVC. Ниже приведены некоторые функции Core Data для вашего справочника: Эффективная интеграция с инструментами iOS и macOS. Организация, фильтрация и группировка данных в памяти и в пользовательском интерфейсе. Автоматическая поддержка хранения объектов. Автоматическая проверка значений свойств. Первый фреймворк для управления объектным графом. Фреймворк Core Data для управления жизненным циклом объекта в объектном графе."
        },
        {
            "question": "Какие функции высшего порядка есть в Swift?",
            "right_answer": "Функции высшего порядка перечислены ниже: Map, Reduce, Sort, Filter"
        },
        {
            "question": "Объясните структуру MVC.",
            "right_answer": "MVC означает модель представление контроллер. MVC - это мощный шаблон архитектуры программного обеспечения для разработки приложений. MVC строится на основе концепций объектно-ориентированного программирования. Он структурирует поток данных и взаимодействие в нашем приложении. Модель-Представление-Контроллер - это важное фундаментальное понятие, которое необходимо понимать в разработке под iOS. Многие iOS-фреймворки, такие как UIKit, Cocoa Touch, используют шаблон MVC для обмена сообщениями и структурированного потока данных. Модель-Представление-Контроллер используется для передачи данных из одной части нашего приложения в другую. Это шаблон проектирования, используемый для назначения объектов в приложении на любую из трех ролей: Модель, Представление, Контроллер."
        }
    ]
}