{
    "category_full_form": "Программист_Full Stack разработчик_Backend часть_PHP + Laravel",
    "category_human_form": "Full Stack разработчик_PHP + Laravel",
    "category_filename_form": "программист_full-stack-разработчик_backend-часть_php-laravel",
    "questions": [
        {
            "question": "Как подключиться к базе данных MySQL в PHP?",
            "right_answer": "Для подключения к базе данных MySQL в PHP вы можете использовать расширения mysqli или PDO. Сначала установите соединение, используя соответствующие параметры подключения, затем выберите базу данных с помощью метода mysqli_select_db() или PDO::exec()."
        },
        {
            "question": "В чем разница между статическими и динамическими веб-сайтами?",
            "right_answer": "Статические веб-сайты хранятся в файловой системе и передаются пользователю как есть. Эти веб-сайты не динамичны и не могут быть изменены без ручного редактирования файлов на сервере. С другой стороны, динамические веб-сайты богаты контентом и могут быть изменены на основе различных внешних факторов. Например, контент может быть изменен на лету на основе ввода пользователя, или контент может быть сгенерирован с помощью базы данных."
        },
        {
            "question": "Назовите некоторые функции в PHP.",
            "right_answer": "Некоторые из наиболее часто используемых функций в PHP включают strlen(), str_replace(), urlencode() и md5(). Эти функции могут выполнять различные задачи, такие как подсчет количества символов в строке, замена содержимого строки, кодирование URL-строки и генерация хеш-значения."
        },
        {
            "question": "Объясните ошибку PHP 'Parse error in PHP - unexpected T_variable at line x'.",
            "right_answer": "Это ошибка синтаксиса в PHP, которая говорит нам, что ошибка на строке x приводит к остановке разбора и выполнения программы."
        },
        {
            "question": "Как объединить две строки в PHP?",
            "right_answer": "Объединение двух строк в PHP просто. Для этого используйте оператор конкатенации, который представляет собой точку (.)."
        },
        {
            "question": "Что такое PHP Magic Methods/Functions?",
            "right_answer": "PHP Magic Methods - это мощные функции, которые выполняют определенные задачи в программе. Эти функции уникальны, поскольку они являются частью языка и могут использоваться для создания пользовательских функций, позволяющих выполнять сложные операции."
        },
        {
            "question": "Что такое лямбда-функция в PHP?",
            "right_answer": "Лямбда-функции в PHP - это специальные функции, которые могут выполнять определенные задачи. Эти функции являются анонимными, что означает, что они объявляются и используются без имени."
        },
        {
            "question": "Как PHP может взаимодействовать с HTML?",
            "right_answer": "PHP предназначен для взаимодействия с HTML. Возможно встраивание PHP скриптов на HTML страницу без проблем и передача информации из HTML в PHP."
        },
        {
            "question": "Как экспортировать данные в файл Excel?",
            "right_answer": "Обычно данные получают в формате, поддерживаемом Excel. Например, мы можем записать файл .csv, выбрать разделитель между полями (например, запятую), а затем открыть файл в Excel."
        },
        {
            "question": "Как вы обрабатываете ошибки в PHP?",
            "right_answer": "Ошибки в PHP можно обрабатывать с помощью блоков try, catch и finally для исключений, а также функций error_reporting() и ini_set() для уровней отчетности об ошибках. Кроме того, запись ошибок в файл или базу данных является распространенной практикой."
        },
        {
            "question": "Что нужно для использования функции изображения?",
            "right_answer": "Для выполнения функций изображения необходима библиотека GD, которая встроена в PHP."
        },
        {
            "question": "Каковы правила именования переменной в PHP?",
            "right_answer": "Именование переменной в PHP просто, но необходимо соблюдать некоторые правила. Имена переменных должны начинаться с буквы или подчеркивания, за которыми может следовать любое количество букв, цифр или подчеркиваний. Кроме того, имена переменных в PHP чувствительны к регистру, что означает, что переменная с именем 'myVariable' отличается от 'my variable.' Кроме того, имена переменных не могут использовать ключевые слова PHP, такие как 'int,' 'float' или 'array.'"
        },
        {
            "question": "Как объявить переменную в PHP?",
            "right_answer": "Переменные в PHP объявляются с использованием символа $, за которым следует имя переменной. Например: $name = 'John';"
        },
        {
            "question": "Какие два наиболее распространенных способа начать и закончить блок кода PHP?",
            "right_answer": "При написании блока кода PHP два наиболее распространенных способа начать и закончить его - использовать открывающий тег."
        },
        {
            "question": "Как передать данные с одной PHP-страницы на другую?",
            "right_answer": "Данные могут быть переданы с одной PHP-страницы на другую с помощью методов, таких как параметры URL, отправка формы, сессии, куки или путем хранения данных в базе данных и извлечения их на последующей странице."
        }
    ]
}