{
	"category_full_form": "Программист_Frontend разработчик_Javascript",
	"category_human_form": "Frontend разработчик_Javascript",
	"category_filename_form": "программист_frontend-разработчик_javascript",
	"questions": [
		{
			"question": "Какова роль отложенных скриптов в JavaScript?",
			"right_answer": "Обработка HTML-кода во время загрузки страницы отключается по умолчанию, пока скрипт не остановится. Ваша страница будет замедлена, если ваша сеть немного медленная или если скрипт очень громоздкий. Когда вы используете отложенный режим, скрипт ждет завершения разбора HTML перед его выполнением. Это сокращает время загрузки веб-страниц, позволяя им появляться быстрее."
		},
		{
			"question": "Объясните WeakMap в javascript.",
			"right_answer": "В javascript Map используется для хранения пар ключ-значение. Пары ключ-значение могут быть как примитивными, так и не примитивными типами. WeakMap похож на Map с ключевыми различиями: ключи и значения в WeakMap должны всегда быть объектами. Если нет ссылок на объект, то объект будет собран сборщиком мусора."
		},
		{
			"question": "В чем разница между клиентским и серверным JavaScript?",
			"right_answer": "Клиентский JavaScript состоит из двух частей: основного языка и предопределенных объектов для выполнения JavaScript в браузере. JavaScript для клиента автоматически включается в HTML-страницы. Во время выполнения браузер понимает этот скрипт. Серверный JavaScript включает выполнение кода JavaScript на сервере в ответ на запросы клиента. Он обрабатывает эти запросы и передает соответствующий ответ клиенту, который может включать клиентский JavaScript для последующего выполнения в браузере."
		},
		{
			"question": "Что означает паттерн проектирования прототип?",
			"right_answer": "Паттерн Прототип производит различные объекты, но вместо возвращения неинициализированных объектов, он создает объекты, значения которых воспроизводятся из шаблона - или образца - объекта. Также известный как паттерн Свойства, паттерн Прототип используется для создания прототипов. Введение бизнес-объектов с параметрами, соответствующими настройкам по умолчанию базы данных, является хорошим примером использования паттерна Прототип. Настройки по умолчанию для вновь созданного бизнес-объекта хранятся в прототипном объекте. Паттерн Прототип практически не используется в традиционных языках, однако он используется при разработке новых объектов и шаблонов на JavaScript, который является прототипным языком."
		},
		{
			"question": "Укажите некоторые преимущества JavaScript.",
			"right_answer": "У JavaScript есть много преимуществ. Некоторые из них: JavaScript выполняется как на стороне клиента, так и на стороне сервера. Существует множество фронтенд-фреймворков, которые вы можете изучить и использовать. Однако, если вы хотите использовать JavaScript на бэкенде, вам нужно будет изучить NodeJS. В настоящее время это единственный фреймворк JavaScript, который можно использовать на бэкенде. JavaScript - простой язык для изучения. Веб-страницы теперь имеют больше функциональности благодаря JavaScript. Для конечного пользователя JavaScript работает довольно быстро."
		},
		{
			"question": "Что вы понимаете под самовызывающимися функциями?",
			"right_answer": "Без запроса самовызывающееся выражение автоматически вызывается (инициируется). Если за выражением функции следует (), оно будет выполнено автоматически. Объявление функции не может быть вызвано само по себе."
		},
		{
			"question": "Объясните ключевое слово «this».",
			"right_answer": "Ключевое слово «this» относится к объекту, свойством которого является функция."
		},
		{
			"question": "Объясните Hoisting в javascript.",
			"right_answer": "Hoisting - это стандартное поведение javascript, при котором все объявления переменных и функций перемещаются наверх. Это означает, что независимо от того, где объявлены переменные и функции, они перемещаются вверх области видимости. Область видимости может быть как локальной, так и глобальной."
		},
		{
			"question": "В чем разница между прототипным и классическим наследованием?",
			"right_answer": "Программисты создают объекты, которые являются представлениями сущностей реального времени, в традиционном ОО программировании. Классы и объекты - два вида абстракций. Класс является обобщением объекта, в то время как объект является абстракцией реального объекта. Например, Транспортное средство - это специализация Автомобиля. В результате, автомобили (класс) происходят от транспортных средств (объект).\n\nКлассическое наследование отличается от прототипного наследования тем, что классическое наследование ограничено классами, которые наследуются от оставшихся классов, в то время как прототипное наследование позволяет любому объекту быть клонированным с помощью метода связывания объектов. Несмотря на слишком многочисленные детали, прототип в основном служит шаблоном для других объектов, независимо от того, расширяют ли они родительский объект или нет."
		},
		{
			"question": "Что вы имеете в виду под BOM?",
			"right_answer": "Объектная модель браузера известна как BOM. Она позволяет пользователям взаимодействовать с браузером. Исходным объектом браузера является окно. В результате вы можете вызывать все функции окна непосредственно или обращаясь к окну. Документ, история, экран, навигатор, местоположение и другие атрибуты доступны в объекте окна."
		}
	]
}
