{
    "category_full_form": "Программист_Разработчик игр_Unity",
    "category_human_form": "Разработчик игр_Unity",
    "category_filename_form": "программист_разработчик-игр_unity",
    "questions": [
        {
            "question": "Что такое обобщения в C# .NET?",
            "right_answer": "Для уменьшения избыточности кода, повышения безопасности типов и производительности можно использовать обобщения для создания классов кода, которые могут быть повторно использованы. Классы коллекций могут быть созданы с использованием обобщений."
        },
        {
            "question": "В чем разница между 'throw' и 'throw ex' в .NET?",
            "right_answer": "'Throw' оператор сохраняет исходный стек ошибок. Но 'throw ex' сохраняет стек вызовов с места исключения."
        },
        {
            "question": "Объясните четыре этапа компиляции кода на C#.",
            "right_answer": "Четыре этапа компиляции кода на C# включают в себя -\n\n1. Компиляция исходного кода в управляемом коде.\n2. Новый созданный код объединяется с кодом сборки.\n3. Загружается среда выполнения общего языка (CLR).\n4. Выполнение сборки выполняется через CLR."
        },
        {
            "question": "Что вы понимаете под свойствами доступа Get и Set?",
            "right_answer": "В C# Get и Set называются аксессорами, потому что они используют свойства. Такие частные поля доступны через аксессоры."
        },
        {
            "question": "Что такое события?",
            "right_answer": "Событие - это уведомление о том, что что-то произошло."
        },
        {
            "question": "Объясните, почему отложенное освещение оптимизирует сцены с большим количеством источников света и элементов.",
            "right_answer": "Во время рендеринга каждый пиксель вычисляется, должен ли он быть освещен и получать влияние света, и это повторяется для каждого источника света. После примерно восьми повторных вычислений для различных источников света в сцене накладные расходы становятся значительными. Для больших сцен количество пикселей, отрисованных, обычно больше, чем количество пикселей на экране. Отложенное освещение заставляет сцену отрисовывать все пиксели без освещения (что быстро), и с дополнительной информацией (за счет низких накладных расходов) вычисляет шаг освещения только для пикселей буфера экрана (что меньше, чем все пиксели, обработанные для каждого элемента). Эта техника позволяет использовать гораздо больше источников света в проекте."
        },
        {
            "question": "Как использовать nullable типы в .Net?",
            "right_answer": "Когда типы значений могут принимать как обычные значения, так и значение null, их называют nullable типами."
        },
        {
            "question": "Обсудите важность Asset Bundles в разработке игр на Unity.",
            "right_answer": "Asset Bundles - это пакеты, содержащие ресурсы (текстуры, модели, звуки и т. д.), которые могут быть загружены динамически во время выполнения. Они позволяют разработчикам уменьшить размер сборки и реализовать потоковую загрузку ресурсов, что является важным для мобильных и онлайн игр, обеспечивая лучший пользовательский опыт и сокращение времени загрузки."
        },
        {
            "question": "Завершите этот код, чтобы объект GameObject, содержащий этот скрипт, двигался с постоянной скоростью к цели и останавливался, когда достигал 1.0 или менее единиц расстояния.",
            "right_answer": "class Mover : MonoBehaviour\n{\n\n Vector3 target;\n float speed;\n\n void Update()\n{\n float distance = Vector3.Distance(target,transform.position);\n\n // будет двигаться только тогда, когда расстояние больше 1.0 единиц\n if(distance > 1.0f)\n {\n Vector3 dir = target - transform.position;\n dir.Normalize();\n transform.position += dir * speed * Time.deltaTime;\n }\n }\n}"
        },
        {
            "question": "В чем разница между Arraylist и Array?",
            "right_answer": "Массив (Array) содержит только элементы одного типа и его размер фиксирован. ArrayList похож на массив, но у него нет фиксированного размера."
        },
        {
            "question": "Что такое модификаторы доступа в C#?",
            "right_answer": "Модификаторы доступа - это термины, которые определяют доступность члена, класса или типа данных программы."
        },
        {
            "question": "В чем разница между блоками finalize и finalize?",
            "right_answer": "После завершения блоков try и catch вызывается блок finalize, поскольку он используется для обработки исключений. Независимо от того, было ли исключение перехвачено, этот блок кода будет выполнен. В целом, код в этом блоке более чистый. Прямо перед сборкой мусора вызывается метод finalize. Основные приоритеты метода finalize - это очистка неуправляемого кода, который автоматически запускается, когда экземпляр не вызывается повторно."
        },
        {
            "question": "В чем разница между операторами “is” и “as” в c#?",
            "right_answer": "Оператор “is” может использоваться для проверки совместимости объекта с заданным типом, и результат возвращается как логическое значение. Оператор “as” может использоваться для приведения объекта к типу или классу."
        },
        {
            "question": "Что такое запечатанные классы в C#?",
            "right_answer": "Когда требуется наложить ограничение на класс, который должен быть унаследован, создаются запечатанные классы. Для предотвращения производных классов используется модификатор sealed. Ошибка времени компиляции возникает, когда запечатанный класс явно указывается как базовый класс."
        },
        {
            "question": "Что такое мультикастинг делегатов в C#?",
            "right_answer": "Мультикастинг делегатов позволяет пользователям указывать на более чем один метод в одном вызове."
        }
    ]
}