{
    "category_full_form": "Программист_Frontend разработчик_HTML",
    "category_human_form": "Frontend разработчик_HTML",
    "category_filename_form": "программист_frontend-разработчик_html",
    "questions": [
        {
            "question": "Являются ли HTML теги и элементы одним и тем же?",
            "right_answer": "Нет, HTML теги используются для определения структуры веб-страницы, в то время как HTML элементы состоят из набора тегов, которые определяют конкретную часть веб-страницы."
        },
        {
            "question": "Как вставить символ копирайта в HTML?",
            "right_answer": "Вы можете вставить символ копирайта, используя &copy; или &#169; в файле HTML."
        },
        {
            "question": "Что такое HTML теги?",
            "right_answer": "Мы используем HTML теги для размещения элементов в правильном и соответствующем формате. Теги используют символы < и >, чтобы отделить их от содержимого HTML. HTML теги не всегда нужно закрывать. Например, в случае изображений закрывающие теги не требуются, как в случае с тегом <img>."
        },
        {
            "question": "Какова роль тега <head> в HTML?",
            "right_answer": "Тег <head> определяет информацию о веб-странице, которая не отображается на самой странице, такую как ее заголовок, ключевые слова и другие метаданные. Он расположен между тегами <html> и <body> и обычно является первым элементом в документе."
        },
        {
            "question": "Какая иерархия стилевых таблиц?",
            "right_answer": "Если один селектор включает три различных определения стилей, то определение, ближайшее к фактическому тегу, имеет приоритет. Встроенный стиль имеет приоритет над внедренными таблицами стилей, которые имеют приоритет над внешними таблицами стилей."
        },
        {
            "question": "Что такое атрибут 'class' в HTML?",
            "right_answer": "Атрибут 'class' в HTML определяет класс для элемента HTML. Он может использоваться для применения определенного стиля к группе элементов на веб-странице."
        },
        {
            "question": "Как вы разделяете секцию текста в HTML?",
            "right_answer": "Мы разделяем секцию текста в HTML, используя следующие теги: тег <br> – он используется для разделения строки текста. Он разрывает текущую строку и переносит поток текста на новую строку. Тег <p> – этот тег используется для написания абзаца текста. Тег <blockquote> – этот тег используется для определения больших цитируемых секций."
        },
        {
            "question": "Как вставить изображение на веб-страницу HTML?",
            "right_answer": "Вы можете вставить изображение на веб-страницу HTML, используя следующий код: <!DOCTYPE html> <html> <body> <h2>Пример изображения HTML</h2> <img src='tulip.jpeg' /> </body> </html>"
        },
        {
            "question": "В чем разница между HTML и XHTML?",
            "right_answer": "HTML и XHTML - это обе языки разметки, используемые для создания веб-страниц. Однако XHTML строже, чем HTML, и требует от разработчиков писать хорошо структурированный код, который соответствует определенным правилам и рекомендациям. XHTML также требует закрытия всех тегов и заключения всех атрибутов в кавычки."
        },
        {
            "question": "Какие существуют типы списков в HTML?",
            "right_answer": "В HTML существуют три типа списков: упорядоченные, неупорядоченные и определения. Упорядоченные списки - это нумерованные списки, неупорядоченные списки - маркированные списки, а списки определений - списки терминов и их определений."
        },
        {
            "question": "Как добавить цвет к тексту в HTML?",
            "right_answer": "Вы можете добавить цвет к тексту в HTML, используя следующий код: <!DOCTYPE html> <html> <body> <h2>Пример цветного текста в HTML</h2> <h1 style=\"color: Red\">Привет HTML</h1> <p style=\"color: Blue\">Строка 1</p> <p style=\"color: Green\">Строка 2</p> </body> </html>"
        },
        {
            "question": "Какова роль тега <meta> в HTML?",
            "right_answer": "Тег <meta> предоставляет дополнительную информацию о веб-странице, такую как автор, описание и ключевые слова. Он находится внутри раздела <head> документа HTML."
        },
        {
            "question": "Что произойдет, если между тегами HTML нет текста?",
            "right_answer": "Если между тегами отсутствует текст, то не будет ничего для форматирования. Следовательно, ничего не появится на экране. Некоторые теги, такие как теги без закрывающего тега, например тег <img>, не требуют наличия текста между ними."
        },
        {
            "question": "В чем разница между HTML и HTML5?",
            "right_answer": "HTML5 - последняя версия HTML и включает в себя новые функции и улучшения по сравнению с предыдущими версиями. Некоторые ключевые различия между HTML и HTML5 включают поддержку мультимедийных элементов (таких как видео и аудио), улучшенную семантику и лучшую поддержку мобильных устройств."
        },
        {
            "question": "В чем разница между Упорядоченным списком и Неупорядоченным списком?",
            "right_answer": "Неупорядоченный список использует теги <ul> </ul>, и каждый элемент списка написан между тегами <li> </li>. Элементы списка отображаются в виде маркеров, а не чисел. Упорядоченный список использует теги <ol> </ol>, и каждый элемент списка написан между тегами <li> </li>. Элементы списка отображаются в виде чисел, а не маркеров."
        }
    ]
}