{
	"category_full_form": "Программист_Разработчик игр_Графическое программирование_OpenGL",
	"category_human_form": "Разработчик игр_OpenGL",
	"category_filename_form": "программист_разработчик-игр_графическое-программирование_opengl",
	"questions": [
		{
			"question": "Что такое OpenGL?",
			"right_answer": "OpenGL (Open Graphics Library) - это кросс-языковый, кросс-платформенный интерфейс прикладного программирования (API) для визуализации 2D и 3D графики."
		},
		{
			"question": "Может ли буфер хранить многомерные данные?",
			"right_answer": "Нет. Хранилище данных, используемое для многомерных данных, таких как изображения, известно как Текстуры."
		},
		{
			"question": "Можем ли мы на самом деле отрисовывать линии без использования вершин в OpenGL?",
			"right_answer": "Нет, мы не можем отрисовывать линии без использования вершин в OpenGL. Линии состоят из двух вершин, поэтому нам необходимо использовать как минимум две вершины для отрисовки линии."
		},
		{
			"question": "Что такое шейдеры GLSL? Вы использовали их раньше?",
			"right_answer": "Шейдеры GLSL - это небольшие программы, написанные на языке шейдеров OpenGL. Они используются для изменения способа отображения графики OpenGL. Я использовал их раньше для создания специальных эффектов, таких как размытие или изменение цвета."
		},
		{
			"question": "Можете ли вы привести примеры платформ, использующих OpenGL?",
			"right_answer": "OpenGL используется на различных платформах, включая, но не ограничиваясь, видеоиграми, симуляциями и CAD-программным обеспечением."
		},
		{
			"question": "Что вы понимаете о вершинах, рёбрах и гранях в контексте OpenGL?",
			"right_answer": "OpenGL использует вершины для определения формы объекта. Рёбра - это линии, соединяющие две вершины, а грани - это многоугольники, образованные рёбрами."
		},
		{
			"question": "Что такое Target?",
			"right_answer": "Цель также известна как точки привязки в OpenGL. Цель определяет тип объекта. Точно так же, как int или float определяют выделенную память для переменной в C++, цель определяет поведение объекта."
		},
		{
			"question": "Что такое объект сэмплера?",
			"right_answer": "Объект сэмплера хранит параметры обертывания и фильтрации, которые контролируют текстуру."
		},
		{
			"question": "В чем разница между Vertex Attribute и Uniform?",
			"right_answer": "Атрибут вершины может быть получен только вершинным шейдером. Uniform - это данные, которые могут быть получены любым шейдером: вершинным, тесселяционным, геометрическим и фрагментным."
		},
		{
			"question": "Что такое Текстурный блок?",
			"right_answer": "Текстурный блок содержит объект текстуры и объект сэмплера."
		},
		{
			"question": "Какие различия между 2D и 3D преобразованиями в OpenGL?",
			"right_answer": "Основное различие между 2D и 3D преобразованиями в OpenGL заключается в способе применения преобразований к объектам. В 2D преобразованиях объекты преобразуются в плоскости, в то время как в 3D преобразованиях объекты преобразуются в трехмерном пространстве. Это означает, что 3D преобразования могут учитывать положение объекта в пространстве, а также его ориентацию, в то время как 2D преобразования могут учитывать только положение объекта на плоскости."
		},
		{
			"question": "В чем разница между программированием в режиме немедленного выполнения и программированием в режиме сохранения?",
			"right_answer": "Программирование в режиме немедленного выполнения - это процесс отрисовки графики на экране по одному кадру за раз. Это означает, что программист должен явно указать компьютеру отрисовать каждый объект в каждом кадре. Программирование в режиме сохранения, с другой стороны, включает в себя создание объекта один раз и затем сохранение его в памяти. Затем программист может указать компьютеру отрисовать этот объект в любое время, не приходится явно указывать все инструкции отрисовки каждый раз."
		},
		{
			"question": "Каковы основные компоненты графического конвейера в OpenGL?",
			"right_answer": "Основными компонентами графического конвейера в OpenGL являются вершинный шейдер, фрагментный шейдер и растеризатор. Вершинный шейдер отвечает за обработку вершин геометрии и передачу их фрагментному шейдеру. Фрагментный шейдер отвечает за обработку фрагментов геометрии и передачу их растеризатору. Растеризатор отвечает за преобразование фрагментов в пиксели и вывод их в буфер кадра."
		},
		{
			"question": "Каково ваше понимание термина «минимизация изменений состояния» в контексте OpenGL?",
			"right_answer": "«Минимизация изменений состояния» относится к идее сокращения количества раз, когда состояние OpenGL изменяется. Это важно, потому что изменение состояния может быть затратной операцией, поэтому минимизация изменений состояния может помочь улучшить производительность приложения OpenGL."
		},
		{
			"question": "Что такое тестирование глубины? Оно необходимо?",
			"right_answer": "Тестирование глубины - это процесс, который позволяет OpenGL определить, какие объекты должны быть видимы, а какие скрыты, исходя из их расстояния от зрителя. Это необходимо для создания иллюзии трехмерного пространства. Без тестирования глубины объекты просто были бы нарисованы друг на друга в порядке их встречи, независимо от их расстояния от зрителя."
		}
	]
}
