{
    "category_full_form": "Программист_Backend разработчик_Docker",
    "category_human_form": "Backend разработчик_Docker",
    "category_filename_form": "программист_backend-разработчик_docker",
    "questions": [
        {
            "question": "На каких платформах можно запустить Docker?",
            "right_answer": "Docker может работать на различных платформах Linux, таких как ArchLinux, CentOS 6+, CRUX 3.0+, Fedora 19/20+, Gentoo, openSUSE 12.3+, RHEL 6.5+, Ubuntu 12.04, 13.04 и др., а также на облачных платформах, таких как Amazon EC2, Amazon ECS, Google Compute Engine, Microsoft Azure, Rackspace."
        },
        {
            "question": "Объясните виртуализацию.",
            "right_answer": "Виртуализация - это способ использования программного обеспечения (например, гипервизора) для создания виртуальной версии ресурса, такого как сервер, хранилище данных или приложение. Виртуализация позволяет разделить систему на ряд отдельных секций, каждая из которых действует как отдельная индивидуальная система."
        },
        {
            "question": "Почему кто-то должен использовать Docker? Что он предлагает?",
            "right_answer": "Docker предоставляет пользователям много стимулов для принятия, такие как: эффективный и простой опыт начальной настройки, средства описания жизненного цикла приложения в деталях, простая конфигурация и плавное взаимодействие с Docker Compose, полная и подробная документация, возможность запуска на ПК или корпоративной ИТ-системе с равной легкостью."
        },
        {
            "question": "Назовите и объясните различные компоненты Docker.",
            "right_answer": "Три основных компонента Docker: Docker Client, Docker Host, Registry. Docker Client выполняет операции Docker build pull и run. Docker Host содержит Docker демон, контейнеры и образы. Реестр - это место, где хранятся образы Docker."
        },
        {
            "question": "Что такое Docker?",
            "right_answer": "Docker - это платформа контейнеризации с открытым исходным кодом. Она используется для автоматизации развертывания любого приложения с использованием легких, портативных контейнеров."
        },
        {
            "question": "Назовите основные команды Docker и их назначение.",
            "right_answer": "Самые важные команды Docker: Build, Commit, Create, Dockerd, Kill. Build создает файл образа Docker, Commit создает новый образ из изменений контейнера, Create создает новый контейнер, Dockerd запускает демон Docker, Kill уничтожает контейнер."
        },
        {
            "question": "Как создать Docker swarm?",
            "right_answer": "Используйте следующую команду: docker swarm init –advertise-addr <manager IP>"
        },
        {
            "question": "Как найти сохраненные тома Docker?",
            "right_answer": "Используйте команду: /var/lib/docker/volumes"
        },
        {
            "question": "Опишите жизненный цикл контейнера Docker.",
            "right_answer": "Обычно жизненный цикл контейнера Docker включает: Создание контейнера, Запуск контейнера, Приостановка контейнера, Возобновление контейнера, Запуск контейнера, Остановка контейнера, Перезапуск контейнера, Уничтожение контейнера."
        },
        {
            "question": "Может ли контейнер перезапуститься самостоятельно?",
            "right_answer": "Поскольку флаг по умолчанию -reset установлен в значение false, контейнер не может перезапуститься самостоятельно."
        },
        {
            "question": "Какая команда для остановки контейнера?",
            "right_answer": "Используйте следующую команду: $ sudo docker stop <container name>"
        },
        {
            "question": "Можно ли реализовать непрерывное развитие (CD) и непрерывную интеграцию (CI) в Docker?",
            "right_answer": "Да, вы можете запустить Jenkins на Docker и использовать Docker Compose для запуска интеграционных тестов для непрерывного развития (CD) и непрерывной интеграции (CI)."
        },
        {
            "question": "Что такое контейнер?",
            "right_answer": "Контейнеры - это развернутые приложения, упакованные со всеми необходимыми зависимостями и файлами конфигурации. Все элементы используют одно и то же ядро ОС. Поскольку контейнер не привязан к какой-либо IT-инфраструктуре, он может работать на другой системе или в облаке."
        },
        {
            "question": "Какие наиболее заметные особенности Docker?",
            "right_answer": "Основные особенности Docker включают: Гибкость приложений, Продуктивность разработчиков, Простое моделирование, Операционная эффективность, Размещение и аффинность, Контроль версий."
        },
        {
            "question": "В чем разница между виртуализацией и контейнеризацией?",
            "right_answer": "Виртуализация - это абстрактная версия физической машины, в то время как контейнеризация - это абстрактная версия приложения."
        }
    ]
}