{
    "category_full_form": "Программист_Frontend разработчик_Алгоритмы и структуры данных",
    "category_human_form": "Frontend разработчик_Алгоритмы и структуры данных",
    "category_filename_form": "программист_frontend-разработчик_алгоритмы-и-структуры-данных",
    "questions": [
        {
            "question": "Назовите способы определения наличия петли в связанном списке.",
            "right_answer": "Использование хэширования\nИспользование метода посещенных узлов (с изменением или без изменения базовой структуры связанного списка)\nАлгоритм поиска цикла Флойда"
        },
        {
            "question": "Зачем нам нужно проводить анализ алгоритмов?",
            "right_answer": "Проблему можно решить несколькими способами с использованием нескольких алгоритмов решения. Анализ алгоритмов предоставляет оценку требуемых ресурсов алгоритма для решения конкретной вычислительной задачи. Также определяется количество временных и пространственных ресурсов, необходимых для выполнения. Временная сложность алгоритма количественно оценивает количество времени, затраченного на выполнение алгоритма как функцию длины ввода. Пространственная сложность количественно оценивает количество пространства или памяти, занимаемое алгоритмом, как функцию длины ввода."
        },
        {
            "question": "Как элементы двумерного массива хранятся в памяти?",
            "right_answer": "Порядок по строкам: - В порядке по строкам все строки двумерного массива хранятся в памяти непрерывным образом. Сначала первая строка массива полностью сохраняется в памяти, за ней следует вторая строка массива и так далее до последней строки. Порядок по столбцам: В порядке по столбцам все столбцы двумерного массива хранятся в памяти в том же порядке. Первый столбец массива полностью сохраняется в памяти, за ним следует вторая строка массива и так далее до того, как последний столбец массива будет полностью записан в памяти."
        },
        {
            "question": "Какие различия между B-деревом и B+ деревом?",
            "right_answer": "B-дерево - это самобалансирующееся m-путевое дерево, где m определяет порядок дерева. В зависимости от числа m, B-дерево является расширением бинарного дерева поиска, в котором у узла может быть более одного ключа и более двух детей. Данные в B-дереве предоставляются упорядоченно, с более низкими значениями в левом поддереве и более высокими значениями в правом поддереве. B+ дерево - это продвинутое самобалансирующееся дерево, поскольку каждый путь от корня дерева до его листа имеет одинаковую длину. Факт того, что все листовые узлы имеют одинаковую длину, указывает на то, что они все находятся на одном уровне. Определенные листовые узлы не могут появляться на третьем уровне, в то время как другие появляются на втором уровне."
        },
        {
            "question": "Как вы бы обнаружили и удалили петлю в связанном списке?",
            "right_answer": "Связанный список - это структура данных, которая, как и массив, является линейной. Однако, в то время как массив хранит свои элементы в смежных местоположениях, связанные списки хранят элементы случайным образом и связывают их через указатели. Обычно связанный список - это структура данных, построенная из узлов, каждый из которых состоит из поля данных и ссылки, указывающей на следующий узел в списке. Петли в связанном списке могут вызвать ошибки в программе. Чтобы хорошо ответить на этот вопрос, вам следует обладать прочными знаниями рекурсии, так как это рекурсивная структура данных. Пример: “Чтобы обнаружить и удалить петлю в связанном списке, вы должны написать функцию detectAndRemoveLoop, которая проверяет наличие петли в связанном списке, а затем удаляет ее, если она присутствует, и затем возвращает true. Если петля не обнаружена, функция возвращает false.”"
        },
        {
            "question": "Перечислите некоторые применения многосвязных структур?",
            "right_answer": "Разреженная матрица\nГенерация индексов"
        },
        {
            "question": "Учитывая целое число «n», напишите функцию для вычисления n-го числа Фибоначчи",
            "right_answer": "Динамическое программирование включает в себя разделение сложной задачи на более простые подзадачи и сохранение решения для каждой подзадачи. Таким образом, программисту не нужно повторно вычислять решение. Использование последовательности Фибоначчи может сократить время выполнения программы. Для ответа на этот вопрос вам следует быть уверенным в алгоритмах и кодировании, поскольку существует множество различных методов написания этой последовательности."
        },
        {
            "question": "Какая структура данных позволяет легко манипулировать элементами в связанном списке?",
            "right_answer": "Лучшая структура данных для перемещения элементов связанного списка - это структура связанного списка. Вы просто изменяете список, а не создаете массив."
        },
        {
            "question": "Что такое структуры данных?",
            "right_answer": "Структура данных - это механический или логический способ организации данных в программе. Организация данных определяет, как программа работает. Существует много типов структур данных, каждая из которых имеет свои собственные применения. При проектировании кода необходимо обращать особое внимание на способ организации данных. Если данные не хранятся эффективно или неправильно структурированы, то общая производительность кода будет снижена."
        },
        {
            "question": "Что такое бинарные деревья?",
            "right_answer": "Бинарное дерево - это структура данных дерева, состоящая из узлов, каждый из которых имеет двух потомков, известных как левый и правый узлы. Дерево начинается с одного узла, называемого корнем."
        },
        {
            "question": "Каковы преимущества связанного списка перед массивом? В каких сценариях мы используем связанный список, а в каких массив?",
            "right_answer": "Преимущества связанного списка перед массивом включают более простую вставку и удаление, динамическую структуру данных, отсутствие потери памяти и более простую реализацию определенных структур данных. Связанные списки используются, когда количество элементов заранее неизвестно, часто выполняются операции добавления или удаления, и когда элементы нужно вставлять в середину списка. Массивы используются, когда требуется случайный доступ к элементам, количество элементов известно заранее, важна скорость при итерации по элементам и эффективность использования памяти."
        },
        {
            "question": "Что такое сортировка слиянием? Как она работает?",
            "right_answer": "Сортировка слиянием - это алгоритм разделяй и властвуй для сортировки данных. Он работает путем слияния и сортировки смежных данных для создания более крупных отсортированных списков, которые затем рекурсивно сливаются для формирования еще более крупных отсортированных списков, пока у вас не будет один отсортированный список."
        },
        {
            "question": "Какова временная сложность базовых операций get() и put() в классе HashMap?",
            "right_answer": "Временная сложность составляет O(1), предполагая, что хеш-функция, используемая в хеш-карте, равномерно распределяет элементы по корзинам"
        },
        {
            "question": "Объясните процесс хранения переменной в памяти.",
            "right_answer": "Переменная хранится в памяти в зависимости от необходимого объема памяти. Вот шаги, которые следуют для хранения переменной: Сначала назначается необходимый объем памяти. Затем он хранится на основе используемой структуры данных. Использование концепций, таких как динамическое выделение, обеспечивает высокую эффективность и доступность хранилищ в реальном времени в соответствии с требованиями."
        },
        {
            "question": "Опишите типы структур данных?",
            "right_answer": "Вот типы структур данных: Списки, Массивы, Записи, Деревья, Таблицы."
        }
    ]
}