{
	"category_full_form": "Программист_DevOps инженер_Облачные платформы",
	"category_human_form": "DevOps инженер_Облачные платформы",
	"category_filename_form": "программист_devops-инженер_облачные-платформы",
	"questions": [
		{
			"question": "Какие цели непрерывной поставки установлены с использованием Google Kubernetes Engine (GKE)?",
			"right_answer": "Настройте свою среду, запустив Cloud Shell и развернув Spinnaker для Google Cloud. Создайте кластер GKE для развертывания образца приложения. Создайте репозиторий Git для образца приложения и загрузите его в Cloud Source Repositories. Создайте образ Docker. Создайте триггеры для создания образов Docker при изменении вашего приложения. Создайте конвейер Spinnaker для надежного и последовательного развертывания вашего приложения в GKE. Разверните изменение кода, запустив конвейер, и наблюдайте за развертыванием изменения в производственной среде."
		},
		{
			"question": "Что такое Azure Boards?",
			"right_answer": "Azure Boards - это сервис Azure DevOps. Он помогает управлять работой в программных проектах и предоставляет широкий спектр функциональности, такой как нативная поддержка Kanban и Scrum, настраиваемые панели инструментов и интегрированная отчетность. Azure Boards включают функции, такие как доски, спринты, элементы работы, панели инструментов, бэклоги, запросы и т. д."
		},
		{
			"question": "Какое полное значение SLA?",
			"right_answer": "SLA расшифровывается как Соглашение об уровне обслуживания."
		},
		{
			"question": "Какие типы инструментов доступны через платформу Google Cloud?",
			"right_answer": "Во-первых, Вычисления. Во-вторых, Сети. В-третьих, Хранение и Базы данных. В-четвертых, Искусственный интеллект (AI) / Машинное обучение (ML). В-пятых, Большие данные. В-шестых, Идентификация и Безопасность. Наконец, Инструменты управления"
		},
		{
			"question": "Что такое AMI?",
			"right_answer": "Amazon Machine Image (AMI) - это образ, поддерживаемый и поддерживаемый AWS, который предоставляет информацию, необходимую для запуска экземпляра."
		},
		{
			"question": "Как можно обеспечить коммуникацию между участниками команды разработки, работающими в разных местах по всему миру, используя Azure DevOps?",
			"right_answer": "Для такого приложения изоляция участников различных проектных команд в разные коммуникационные каналы является первым критерием. Кроме того, поддержание истории коммуникации в соответствующих каналах необходимо. Эффективная интеграция с Azure DevOps также важна для приложения и позволяет добавлять внешних поставщиков и подрядчиков в проекты. Команды Microsoft реализовали эти требования через предоставление правильных возможностей. Классификация команд позволяет создавать различные каналы пользователями для организации коммуникаций в соответствии с темой. Каждый канал может включать от нескольких до тысяч пользователей. Microsoft Teams предоставляет функцию гостевого доступа, которая позволяет внешним лицам присоединяться к внутренним каналам для проведения встреч, обмена файлами и обмена сообщениями. Это помогает в управлении проектами B2B и может напрямую интегрироваться с Azure DevOps."
		},
		{
			"question": "Каково назначение универсальной системы управления артефактами сборки?",
			"right_answer": "Ваш бизнес может управлять контейнерными образами и языковыми пакетами в одном месте с помощью Artifact Registry. Он поддерживает нативные протоколы артефактов и полностью интегрирован с инструментами и средами выполнения Google Cloud. Это упрощает настройку автоматизированных конвейеров путем интеграции с вашими инструментами CI/CD."
		},
		{
			"question": "Опишите сценарий использования Amazon Elastic Container Service (ECS) в DevOps",
			"right_answer": "Самый распространенный случай - когда у вас есть микросервис, который вы хотите развернуть в среде без предварительного обеспечения. Это можно сделать, создав образ Docker микросервиса и сохранив его в реестре образов, таком как Elastic Container Registry (ECR), который затем можно использовать в Определении задачи. Используя технологии, такие как Fargate, вы можете развернуть это в кластере ECS."
		},
		{
			"question": "Что вы понимаете под термином Цель уровня обслуживания (SLO)?",
			"right_answer": "Когда система недоступна, она не способна выполнять свою цель и по умолчанию завершится неудачей. Любые будущие обсуждения о том, работает ли система достаточно надежно, а также какие изменения в дизайне или архитектуре следует внести, должны быть сформулированы в терминах способности этой системы удовлетворять SLO."
		},
		{
			"question": "Что такое облачные вычисления?",
			"right_answer": "Облачные вычисления - это предоставление ИТ-услуг по требованию с оплатой по мере использования через Интернет. Вместо покупки, эксплуатации и обслуживания физических центров обработки данных и серверов, вы можете арендовать вычислительную мощность, хранилище и базы данных у облачного провайдера, такого как Google, по мере необходимости. Облачный сервис по вычислениям действительно мировой, без региональных или граничных ограничений."
		},
		{
			"question": "Какие основные функции предлагает Memcached?",
			"right_answer": "Memcached предлагает широкий спектр функций, таких как: токены CAS, обратные вызовы, GetDelayed, бинарный протокол, Igbinary"
		},
		{
			"question": "Опишите Infrastructure as Code (IaC) своими словами.",
			"right_answer": "IaC - это управление инфраструктурой (сети, виртуальные машины, балансировщики нагрузки и топология соединения) в описательной модели, используя тот же контроль версий, который использует команда DevOps для исходного кода. Это делает его воспроизводимым и последовательным."
		},
		{
			"question": "Какую функцию можно использовать для разработки многоуровневого приложения с использованием веб-приложений Azure App Service в качестве фронтенда и базы данных Azure SQL в качестве бэкенда?",
			"right_answer": "Подходящий вариант в данном случае - это Карта приложения в Azure Application Insights. Это потому, что она помогает выявить узкие места в производительности и точки отказа в различных компонентах многоуровневых приложений. Компоненты приложения и их зависимости представлены узлами на карте. Кроме того, она также способна предоставлять статус здоровья KPI и оповещения."
		},
		{
			"question": "Что такое Azure Test Plans?",
			"right_answer": "Azure Test Plans - это сервис, предоставляемый Azure DevOps. Он предоставляет решение для управления тестированием на основе браузера с важными возможностями в тестировании на приемку пользователей, исследовательском тестировании и плановом ручном тестировании. Также включает расширение браузера для проведения исследовательского тестирования и обратной связи от заинтересованных сторон."
		}
	]
}
