{
	"category_full_form": "Программист_Backend разработчик_Базы данных_SQL Server",
	"category_human_form": "Backend разработчик_SQL Server",
	"category_filename_form": "программист_backend-разработчик_базы-данных_sql-server",
	"questions": [
		{
			"question": "Что такое пользовательская функция в SQL Server?",
			"right_answer": "Пользовательская функция позволяет пользователям писать свою логику по мере необходимости. Преимущество заключается в том, что она не ограничивается предопределенными функциями и позволяет писать простой или сложный SQL-код. Тип возвращаемого значения может быть таблицей или скалярным значением."
		},
		{
			"question": "Когда записи могут быть удалены из представления в SQL Server?",
			"right_answer": "Записи могут быть удалены из 'простого' представления, так как оно содержит данные только из одной таблицы."
		},
		{
			"question": "Каково значение CHECK в SQL Server?",
			"right_answer": "Ограничение CHECK ограничивает значения, которые могут быть помещены в столбец таблицы. Это поддерживает целостность данных. Ограничение используется по столбцам для задания конкретных значений этому столбцу. Пример: CONSTRAINT CHK_Student CHECK (age<20)"
		},
		{
			"question": "Когда следует использовать курсоры, основанные на сервере?",
			"right_answer": "Когда вам нужно работать с одной записью в любой момент времени, вместо того чтобы брать все данные из таблицы как пакет. Производительность курсоров страдает, когда присутствуют большие объемы данных."
		},
		{
			"question": "Что означает столбец идентификатора в SQL?",
			"right_answer": "В SQL столбец идентификатора генерирует числовые значения автоматически. Эти столбцы не обязательно индексировать, и мы можем определить начальное и инкрементное значение столбца идентификатора."
		},
		{
			"question": "Что такое TCL-команды? и перечислите TCL-команды, доступные в SQL Server?",
			"right_answer": "TCL или команды языка управления транзакциями используются для управления различными транзакциями, происходящими в базе данных. Три команды TCL: Rollback, Save Tran и Commit."
		},
		{
			"question": "Расскажите шаги по скрытию экземпляров SQL Server.",
			"right_answer": "Для скрытия экземпляров SQL Server необходимо внести изменения в Менеджере конфигурации SQL Server, и для запуска этого требуется выполнить следующие шаги: Выбрать экземпляр SQL сервера, Выбрать свойства после щелчка правой кнопкой мыши, Установить Скрыть экземпляры на Да и нажать ПРИМЕНИТЬ, После внесения изменений перезапустить экземпляр SQL Server"
		},
		{
			"question": "Укажите запрос, который возвращает список триггеров в базе данных.",
			"right_answer": "Select * from sys.objects where type='tr'"
		},
		{
			"question": "Объясните команду DBCC и ее использование.",
			"right_answer": "Команда Database Consistency Checker (DBCC) проверяет целостность базы данных; Она помогает в проверке и мониторинге обслуживания базы данных, таблиц и проверке операций."
		},
		{
			"question": "Какую команду можно использовать для получения версии SQL Server?",
			"right_answer": "Select SERVERPROPERTY('productversion')"
		},
		{
			"question": "Как создать таблицу в SQL?",
			"right_answer": "Для создания таблицы в SQL используется следующий запрос: Create table name_of_table( column1 datatype, column2 datatype ) Например: create table Student ( Name varchar(20), DOB date, Marks nvarchar(5), Subject varchar(20) )"
		},
		{
			"question": "Расскажите о применении UPDATE STATISTICS.",
			"right_answer": "UPDATE STATISTICS используется для обновления информации о распределении ключевых значений для одной или нескольких групп/коллекций статистики в индексированном представлении или указанной таблице."
		}
	]
}
