{
	"category_full_form": "Программист_Мобильный разработчик_Алгоритмы и структуры данных",
	"category_human_form": "Мобильный разработчик_Алгоритмы и структуры данных",
	"category_filename_form": "программист_мобильный-разработчик_алгоритмы-и-структуры-данных",
	"questions": [
		{
			"question": "Что такое асимптотический анализ алгоритма?",
			"right_answer": "Асимптотический анализ - это техника определения времени выполнения алгоритма в математических единицах для определения пределов программы, также известная как 'производительность времени выполнения'. Цель состоит в том, чтобы определить лучший случай, худший случай и среднее время для завершения определенной деятельности. Хотя это не техника обучения глубокому обучению, асимптотический анализ является важным диагностическим инструментом для программистов для анализа эффективности алгоритма, а не его корректности."
		},
		{
			"question": "Перечислите некоторые применения многосвязных структур?",
			"right_answer": "Разреженная матрица\nГенерация индексов"
		},
		{
			"question": "Что такое приоритетная очередь? Каковы применения для приоритетной очереди?",
			"right_answer": "Приоритетная очередь - это абстрактный тип данных, похожий на очередь, в которой каждому элементу присваивается приоритетное значение. Порядок обслуживания элементов в приоритетной очереди определяется их приоритетом (т.е. порядком удаления). Если элементы имеют одинаковый приоритет, они обслуживаются в порядке их появления в очереди. Вот некоторые реальные применения для приоритетной очереди: используется в алгоритмах графов, таких как Дейкстра, минимальное остовное дерево Прима и т. д. Код Хаффмана для сжатия данных. Поиск k-го наибольшего/наименьшего элемента."
		},
		{
			"question": "Какой алгоритм сортировки считается самым быстрым? Почему?",
			"right_answer": "Нельзя считать один алгоритм сортировки лучшим, так как каждый алгоритм разработан для конкретной структуры данных и набора данных. Однако алгоритм QuickSort обычно считается самым быстрым, потому что он имеет лучшую производительность для большинства входных данных. Его преимущества перед другими алгоритмами сортировки включают в себя эффективное использование кэша, возможность пропускать некоторые обмены, эффективность даже в худших случаях входных наборов, легкую адаптацию к уже отсортированным или в основном отсортированным входным данным и приоритет скорости над стабильностью."
		},
		{
			"question": "Что такое постфиксное выражение?",
			"right_answer": "Постфиксное выражение состоит из операторов и операндов, при этом оператор следует после операндов. То есть, в постфиксном выражении оператор идет после операндов. Каков правильный постфиксный вид? Правильная постфиксная фраза - A B + C *."
		},
		{
			"question": "Объясните процесс хранения переменной в памяти.",
			"right_answer": "Переменная хранится в памяти в зависимости от необходимого объема памяти. Вот шаги, которые следуют для хранения переменной: Сначала назначается необходимый объем памяти. Затем он хранится на основе используемой структуры данных. Использование концепций, таких как динамическое выделение, обеспечивает высокую эффективность и доступность хранилищ на основе требований в реальном времени."
		},
		{
			"question": "Что такое структура данных?",
			"right_answer": "Структура данных - это способ организации (хранения) и обработки данных для извлечения и доступа. Она также определяет способ взаимосвязи различных наборов данных, устанавливая отношения и формируя алгоритмы."
		},
		{
			"question": "В чем разница между стеком и очередью в структуре данных?",
			"right_answer": "Стек - это линейная структура данных, в которой данные добавляются и удаляются с вершины. Очередь - это линейная структура данных, в которой данные добавляются в конец и удаляются из начала. Стек основан на принципе LIFO (последний пришел, первый ушел). Очередь основана на принципе FIFO (первый пришел, первый ушел). Операция вставки в стеке называется push. Операция вставки в очереди называется eneque. Операция удаления в стеке называется pop. Операция удаления в очереди называется dequeue. Для добавления и удаления доступен только один указатель: top(). Для добавления и удаления доступны два указателя: front() и rear(). Используется для решения проблем рекурсии. Используется для решения проблем последовательной обработки."
		},
		{
			"question": "Что такое структура данных связанный список?",
			"right_answer": "Это один из самых часто задаваемых вопросов на собеседованиях по структурам данных, где интервьюер ожидает, что вы дадите исчерпывающий ответ. Постарайтесь объяснить как можно больше, а не заканчивать свой ответ одним предложением! Это линейная структура данных или последовательность объектов данных, где элементы не хранятся в смежных ячейках памяти. Элементы связаны с использованием указателей для формирования цепочки. Каждый элемент является отдельным объектом, называемым узлом. У каждого узла есть два элемента: поле данных и ссылка на следующий узел. Точка входа в связанный список называется головой. Если список пуст, то голова является нулевой ссылкой, а последний узел имеет ссылку на нуль. Связанный список - это динамическая структура данных, где количество узлов не фиксировано, и список имеет возможность увеличиваться и уменьшаться по требованию. Он применяется в случаях, когда: Мы имеем дело с неизвестным количеством объектов или не знаем, сколько элементов в списке Нам нужны операции вставки/удаления элементов из списка за постоянное время, как в вычислениях в реальном времени, где критична предсказуемость времени Не требуется случайный доступ к любым элементам Алгоритм требует структуры данных, где объекты должны храниться независимо от их физического адреса в памяти Нам нужно вставлять элементы в середину списка, как в очереди с приоритетом Некоторые реализации - это стеки и очереди, графы, каталог имен, динамическое выделение памяти и выполнение арифметических операций над длинными целыми числами."
		},
		{
			"question": "Каковы применения графов?",
			"right_answer": "Транспортные сети, где станции представлены как вершины, а маршруты как рёбра графа\nГрафики утилиты электроэнергии или воды, где вершины - точки подключения, а рёбра - провода или трубы, их соединяющие\nГрафы социальных сетей для определения потока информации и точек роста (рёбра и вершины)\nНейронные сети, где вершины представляют нейроны, а рёбра - синапсы между ними"
		},
		{
			"question": "Что такое hashmap в структуре данных?",
			"right_answer": "Hashmap - это структура данных, которая использует реализацию структуры данных хэш-таблицы, которая позволяет получить доступ к данным за постоянное время (O(1)) сложности, если у вас есть ключ"
		},
		{
			"question": "Что такое структура данных стек? Каковы применения стека?",
			"right_answer": "Стек - это структура данных, которая используется для представления состояния приложения в определенный момент времени. Стек состоит из серии элементов, которые добавляются в верхнюю часть стека, а затем удаляются с верхушки. Это линейная структура данных, которая следует определенному порядку выполнения операций. LIFO (последний пришел, первый ушел) или FILO (первый пришел, последний ушел) - два возможных порядка. Стек состоит из последовательности элементов. Элемент, добавленный последним, будет извлечен первым, реальный пример может быть стопка одежды одна на другой. Когда мы удаляем ткань, которая была ранее сверху, мы можем сказать, что ткань, добавленная последней, выходит первой. Ниже приведены некоторые применения структуры данных стек: Он действует как временное хранилище во время рекурсивных операций, Операции Повторить и Отменить в редакторах документов, Реверс строки, Сопоставление скобок, Постфиксные к инфиксным выражениям, Порядок вызовов функций"
		},
		{
			"question": "Какие операции можно выполнить со стеком?",
			"right_answer": "Стек может выполнять три основные операции: PUSH, POP и PEEK."
		},
		{
			"question": "Объясните структуру данных max heap.",
			"right_answer": "Это тип структуры данных куча, где значение корневого узла больше или равно значению любого из его дочерних узлов."
		}
	]
}
