{
    "category_full_form": "Программист_Аналитик данных_Python",
    "category_human_form": "Аналитик данных_Python",
    "category_filename_form": "программист_аналитик-данных_python",
    "questions": [
        {
            "question": "Что такое модули Python? Назовите несколько встроенных модулей Python, которые часто используются.",
            "right_answer": "Модули Python - это файлы, содержащие код Python. В этом коде могут использоваться функции, классы или переменные. Модуль Python - это файл .py, содержащий код, который может быть выполнен. Вот несколько часто используемых встроенных модулей: JSON, data time, random, math, sys, OS."
        },
        {
            "question": "Как найти позиции чисел, которые являются кратными трём из серии?",
            "right_answer": "np.argwhere(ser % 3==0)"
        },
        {
            "question": "В Python аргументы передаются по значению или по ссылке?",
            "right_answer": "Аргументы передаются по ссылке в Python."
        },
        {
            "question": "Что такое словарь в Python?",
            "right_answer": "Словарь - один из встроенных типов данных Python. Он устанавливает однозначное соответствие между ключами и значениями. Ключи и значения словаря хранятся парами в словарях. Ключи используются для индексации словарей."
        },
        {
            "question": "Существует ли встроенный цикл do-while в Python?",
            "right_answer": "Нет"
        },
        {
            "question": "В чем разница между поверхностным копированием и глубоким копированием?",
            "right_answer": "Deepcopy создает другой объект и заполняет его дочерними объектами исходного объекта. Поэтому изменения в исходном объекте не отражаются в копии. Поверхностное копирование создает другой объект и заполняет его ссылками на дочерние объекты внутри исходного объекта. Поэтому изменения в исходном объекте отражаются в копии."
        },
        {
            "question": "Что такое PEP 8?",
            "right_answer": "PEP обозначает Предложение по улучшению Python. Это сборник рекомендаций по форматированию кода Python для максимальной читаемости."
        },
        {
            "question": "Как в Python управляется память?",
            "right_answer": "Управление памятью в Python осуществляется частным кучей. Частная куча содержит все объекты Python и структуры данных. Эта секретная куча недоступна программисту. Вместо этого об этом заботится интерпретатор Python. Python также включает в себя встроенный сборщик мусора, который перерабатывает всю неиспользуемую память и делает ее доступной для кучи. Управление памятью в Python отвечает за выделение кучи для объектов Python. Основной API предоставляет программистам доступ к некоторым инструментам программирования."
        },
        {
            "question": "Как вы будете делать первую букву строки заглавной?",
            "right_answer": "Функция capitalize() в Python делает первую букву строки заглавной. Она возвращает исходный текст, если строка уже содержит заглавную букву в начале."
        },
        {
            "question": "Используются ли в Python спецификаторы доступа?",
            "right_answer": "Доступ к переменной экземпляра или функции в Python не ограничен. Чтобы имитировать поведение защищенных и закрытых спецификаторов доступа, Python вводит идею префиксации имени переменной, функции или метода одинарным или двойным подчеркиванием."
        },
        {
            "question": "Как написать Unicode строку в Python?",
            "right_answer": "Старый тип Unicode был заменен на тип 'str' в Python 3, и строка теперь по умолчанию считается Unicode. Используя функцию art.title.encode('utf-8'), мы можем создать Unicode строку."
        },
        {
            "question": "Объясните пакеты Python.",
            "right_answer": "Пакеты в Python - это пространства имен, которые содержат множество модулей."
        },
        {
            "question": "Что такое массив Numpy?",
            "right_answer": "Массив numpy - это сетка значений, все одного типа, и индексируется кортежем неотрицательных целых чисел. Количество измерений определяет ранг массива. Форма массива - это кортеж целых чисел, указывающий размер массива вдоль каждого измерения."
        },
        {
            "question": "Каков вывод: Print(__name__)? Обоснуйте свой ответ.",
            "right_answer": "__name__ - это специальная переменная, которая содержит имя текущего модуля. Выполнение программы начинается с главного или кода с нулевым отступом. Таким образом, в данном случае __name__ имеет значение __main__. Если файл импортируется из другого модуля, __name__ содержит имя этого модуля."
        },
        {
            "question": "Объясните функции join() и split() в Python.",
            "right_answer": "Функция join() может быть использована для объединения списка строк на основе разделителя в одну строку. Функция split() может быть использована для разделения строки на список строк на основе разделителя."
        }
    ]
}