{
	"category_full_form": "Программист_Backend разработчик_Базы данных_PostgreSQL",
	"category_human_form": "Backend разработчик_PostgreSQL",
	"category_filename_form": "программист_backend-разработчик_базы-данных_postgresql",
	"questions": [
		{
			"question": "Какое полное значение ORDBMS?",
			"right_answer": "Полное значение ORDBMS - это Система управления базами данных объектно-реляционной модели."
		},
		{
			"question": "Как можно выбрать первые 5 записей в PostgreSQL?",
			"right_answer": "Ключевое слово LIMIT может быть использовано для выбора первых N записей в PostgreSQL."
		},
		{
			"question": "Какова цель утилиты pg_archivecleanup в PostgreSQL?",
			"right_answer": "Основная цель инструмента pg_archivecleanup в PostgreSQL - избавиться от файлов WAL (Write Ahead Logging) из каталога. Это гарантирует, что будут сохранены только необходимые файлы WAL, необходимые для восстановления в определенный момент времени (PITR)."
		},
		{
			"question": "Назовите различные типы операторов, используемых в PostgreSQL.",
			"right_answer": "Операторы - это специальные символы или слова, которые используются в основном в предложении WHERE в PostgreSQL. Эти операторы могут использоваться для выполнения различных функций и операций. Различные типы операторов, используемых в PostgreSQL, следующие: арифметические операторы, логические операторы, операторы сравнения, побитовые операторы."
		},
		{
			"question": "Каковы преимущества логической репликации по сравнению с методами физической репликации?",
			"right_answer": "Преимущества логической репликации: В логической репликации возможно селективное копирование, что делает ее более гибкой для выбора данных для репликации. Физическая репликация требует идентичных версий PostgreSQL на обоих основных серверах и резервных серверах, в то время как логическая репликация может работать с разными версиями PostgreSQL. Логическая репликация предлагает большую гибкость по сравнению с физической репликацией в обработке изменений в схеме. Логическая репликация совместима с несколькими приложениями и задачами по обслуживанию базы данных."
		},
		{
			"question": "Что такое не кластеризованный индекс?",
			"right_answer": "В не кластеризованном индексе порядок строк индекса отличается от физического порядка реальных данных. Листовые страницы не кластеризованного индекса содержат указатели на реальные данные, а не сами данные. Его основное преимущество заключается в том, что он обеспечивает более быстрый доступ к данным."
		},
		{
			"question": "Перечислите недостатки PostgreSQL.",
			"right_answer": "Несмотря на множество преимуществ, у PostgreSQL есть много недостатков. Некоторые из них включают: PostgreSQL может иметь более медленную скорость по сравнению с MySQL. Он поддерживает меньше открытых приложений по сравнению с MySQL. Распознаваемость на рынке для PostgreSQL была вызовом из-за отсутствия конкретного владельца. Его производительность может быть ниже, чем у MySQL в определенных ситуациях."
		},
		{
			"question": "Опишите кратко историю PostgreSQL.",
			"right_answer": "PostgreSQL возник как важная часть проекта POSTGRES, инициированного профессором Майклом Стоунбрейкером в 1986 году в Университете Калифорнии, Беркли. Он совместим с основными операционными системами, такими как macOS, Windows, Linux и UNIX. PostgreSQL поддерживает свойства ACID с 2001 года, с непрерывным развитием ядра платформы на протяжении более трех десятилетий. Он включает значительные дополнения, такие как расширение базы данных PostGIS, и стал стандартной базой данных для macOS, обычно известной как Postgres, благодаря широкому распространению стандарта SQL среди реляционных баз данных."
		},
		{
			"question": "Каково значение PgAdmin?",
			"right_answer": "PgAdmin - это бесплатный графический интерфейс с открытым исходным кодом для администрирования баз данных PostgreSQL."
		},
		{
			"question": "Как можно выполнить восстановление до определенного момента времени в PostgreSQL?",
			"right_answer": "Для выполнения восстановления до определенного момента времени в PostgreSQL необходимо: Убедитесь, что включено архивирование WAL. Восстановите базовую резервную копию. Примените файлы WAL, либо используя recovery.conf, либо через сервер. Остановите процесс восстановления, когда достигнете желаемой точки восстановления. Разрешите операции на чтение и запись в базе данных."
		},
		{
			"question": "Объясните термин 'Последовательность' в PostgreSQL.",
			"right_answer": "Последовательность - это генератор, который производит прогрессивный номер, который может помочь синхронизировать ключи между несколькими строками или таблицами и автоматически создавать один первичный ключ."
		},
		{
			"question": "Сколько типов репликации существует в PostgreSQL?",
			"right_answer": "В PostgreSQL существует в основном четыре типа репликации: Физическая репликация (Поточная репликация, Файловая репликация), Логическая репликация (Встроенная логическая репликация, Инструменты сторонних разработчиков), Двунаправленная репликация (BDR), Пользовательские решения по репликации."
		}
	]
}
