{
    "category_full_form": "Программист_Full Stack разработчик_Frontend часть_Angular",
    "category_human_form": "Full Stack разработчик_Angular",
    "category_filename_form": "программист_full-stack-разработчик_frontend-часть_angular",
    "questions": [
        {
            "question": "Как использовать ngFor в теге?",
            "right_answer": "Директива ngFor используется для создания списков и таблиц в HTML-шаблонах. Простыми словами, эта директива используется для итерации по массиву или объекту и создания шаблона для каждого элемента."
        },
        {
            "question": "Что такое декораторы методов?",
            "right_answer": "Декораторы методов в Angular - это декораторы, которые могут быть применены к методам внутри класса. Они используются для изменения поведения метода или добавления дополнительной функциональности. Декораторы методов определяются с использованием символа @, за которым следует имя декоратора и размещаются непосредственно перед объявлением метода. Их можно использовать для задач, таких как ведение журнала, кэширование или изменение поведения метода на основе определенных условий."
        },
        {
            "question": "Что такое директивы в Angular?",
            "right_answer": "Директивы - это атрибуты, которые позволяют пользователю писать новый HTML-синтаксис, специфичный для их приложений. Они выполняются каждый раз, когда компилятор Angular находит их в DOM. Angular поддерживает три типа директив: директивы компонентов, структурные директивы и директивы атрибутов."
        },
        {
            "question": "Что такое контроллеры?",
            "right_answer": "Контроллеры AngularJS управляют данными приложений AngularJS. Они являются обычными объектами JavaScript. Директива ng-controller определяет контроллер приложения."
        },
        {
            "question": "Что означает Angular Material?",
            "right_answer": "Angular Material - это библиотека компонентов пользовательского интерфейса для приложений Angular. Она предоставляет набор готовых и настраиваемых компонентов пользовательского интерфейса, таких как кнопки, формы, навигационные меню и диалоговые окна, которые следуют рекомендациям Material Design. Angular Material упрощает процесс создания последовательных и визуально привлекательных пользовательских интерфейсов в Angular. Она предлагает широкий спектр функций и стилей, которые легко интегрируются в проекты Angular."
        },
        {
            "question": "Как включить SASS в проект Angular?",
            "right_answer": "Чтобы включить SASS в проект Angular, вам нужно установить необходимые зависимости и настроить проект соответственно. Следуйте предоставленным шагам."
        },
        {
            "question": "Что такое TypeScript?",
            "right_answer": "TypeScript - это надмножество JavaScript, которое обеспечивает отличную последовательность. Он настоятельно рекомендуется, поскольку предоставляет некоторый синтаксический сахар и делает код более удобным для понимания и поддержки. В конечном итоге, код TypeScript компилируется в JavaScript, который может эффективно работать в любой среде."
        },
        {
            "question": "Что такое фильтры в Angular? Назовите несколько из них.",
            "right_answer": "Фильтры используются для форматирования выражения и его представления пользователю. Их можно использовать в представлениях, контроллерах или сервисах. Некоторые встроенные фильтры включают следующие. date - Форматирование даты в указанный формат. filter - Выбор подмножества элементов из массива. Json - Форматирование объекта в строку JSON. limitTo - Ограничение массива/строки до указанного количества элементов/символов. lowercase - Преобразование строки в нижний регистр."
        },
        {
            "question": "Что такое операторы шаблона?",
            "right_answer": "Операторы шаблона - это свойства или методы, используемые в HTML для реагирования на события пользователя. С помощью этих операторов шаблона приложение, которое вы создаете или работаете, может иметь возможность взаимодействовать с пользователями через действия, такие как отправка форм и отображение динамического контента."
        },
        {
            "question": "Что такое компиляция AOT? Каковы ее преимущества?",
            "right_answer": "Компилятор Ahead-of-time (AOT) преобразует код Angular HTML и TypeScript в код JavaScript во время фазы сборки, т.е. до загрузки и выполнения кода браузером. Некоторые из ее преимуществ: более быстрое отображение, меньше асинхронных запросов, меньший размер загрузки фреймворка Angular, быстрое обнаружение ошибок в шаблонах и лучшая безопасность."
        },
        {
            "question": "Что такое транспиляция в Angular?",
            "right_answer": "Транспиляция в Angular относится к процессу преобразования кода TypeScript в код JavaScript, который могут выполнять веб-браузеры."
        },
        {
            "question": "Напишите код для передачи данных от родительского компонента к дочернему компоненту?",
            "right_answer": "Для передачи данных от родительского компонента к дочернему компоненту в Angular можно использовать входные свойства. Входные свойства позволяют передавать данные от родительского компонента к дочернему компоненту."
        },
        {
            "question": "Что такое клиентская отрисовка в Angular?",
            "right_answer": "Клиентская отрисовка означает, что приложение Angular отрисовывается на стороне клиента — в веб-браузере пользователя."
        },
        {
            "question": "Что такое Сервисы в Angular?",
            "right_answer": "Сервисы Angular выполняют задачи, которые используются несколькими компонентами. Эти задачи могут включать получение данных и изображений, сетевые подключения и управление базами данных, среди прочего. Они выполняют все операционные задачи для компонентов и избегают повторного написания кода. Сервис можно написать один раз и внедрить во все компоненты, которые используют этот сервис."
        },
        {
            "question": "Что такое декораторы в Angular?",
            "right_answer": "Декораторы - это шаблон проектирования или функции, которые определяют, как работают функции Angular. Они используются для предварительных модификаций класса, сервиса или фильтра. Angular поддерживает четыре типа декораторов: декораторы класса, декораторы свойств, декораторы методов, декораторы параметров."
        }
    ]
}