{
    "category_full_form": "Программист_Backend разработчик_Алгоритмы и структуры данных",
    "category_human_form": "Backend разработчик_Алгоритмы и структуры данных",
    "category_filename_form": "программист_backend-разработчик_алгоритмы-и-структуры-данных",
    "questions": [
        {
            "question": "Что такое hashmap в структуре данных?",
            "right_answer": "Hashmap - это структура данных, которая использует реализацию структуры данных хэш-таблицы, которая позволяет получить доступ к данным за постоянное время (O(1)), если у вас есть ключ"
        },
        {
            "question": "Что такое многомерный массив?",
            "right_answer": "Многомерный массив - это массив с более чем одним измерением. Это массив массивов или массив с многочисленными слоями. Двумерный массив, или двумерный массив, является самым базовым многомерным массивом. Как вы увидите в коде, это технически массив массивов. Двумерный массив также называется матрицей или таблицей с рядами и столбцами. Объявление многомерного массива такое же, как и объявление одномерного массива. Мы должны уведомить C, что у нас есть два измерения для двумерного массива."
        },
        {
            "question": "Что такое структура данных?",
            "right_answer": "Структура данных - это способ организации (хранения) и обработки данных для извлечения и доступа. Она также определяет способ взаимосвязи различных наборов данных, устанавливая отношения и формируя алгоритмы."
        },
        {
            "question": "Какие различные операции доступны в структуре данных стек?",
            "right_answer": "Некоторые из основных операций, предоставляемых в структуре данных стек, включают: push, pop, top, isEmpty, size."
        },
        {
            "question": "Разница между массивом и связным списком.",
            "right_answer": "Массивы\tСвязные списки\nМассив - это коллекция элементов данных одного типа. Связный список - это коллекция сущностей, известных как узлы. Узел делится на две секции: данные и адрес. Он хранит элементы данных в одной памяти. Он хранит элементы в случайном порядке или где угодно в памяти. Размер памяти массива фиксирован и не может быть изменен во время выполнения. Размер памяти связного списка выделяется во время выполнения. Элементы массива не зависят друг от друга. Элементы связного списка зависят друг от друга. Доступ к элементу в массиве проще и быстрее. В связном списке доступ к элементу занимает время. Использование памяти неэффективно в случае массива. Использование памяти эффективно в случае связных списков. Операции, такие как вставка и удаление, занимают больше времени в массиве. Операции, такие как вставка и удаление, выполняются быстрее в связном списке."
        },
        {
            "question": "Определите Красно-черное дерево и его применения",
            "right_answer": "Красно-черные деревья - это тип самобалансирующегося двоичного дерева поиска. Рудольф Байер изобрел его в 1972 году и назвал его 'симметричными двоичными B-деревьями'. Красно-черное дерево - это двоичное дерево, в котором каждый узел имеет атрибут цвета, либо красный, либо черный. Путем сравнения цветов узлов на любом простом пути от корня к листу красно-черные деревья гарантируют, что ни один путь не будет вдвое длиннее другого, обеспечивая тем самым общий баланс дерева. Красно-черные деревья похожи на двоичные деревья в том, что они оба хранят свои данные в двоичных форматах дополнительного кода. Однако у красно-черных деревьев есть одно важное преимущество перед двоичными деревьями: они быстрее доступны. Поскольку красно-черные деревья так быстро доступны, их часто используют для хранения больших объемов данных. Красно-черные деревья могут использоваться для хранения любого типа данных, которые могут быть представлены в виде набора значений. Каждое красно-черное дерево подчиняется следующим правилам: Каждый узел либо красный, либо черный. Корень дерева всегда черный. Нет двух смежных красных узлов. На каждом пути от узла к любому из его потомков NULL одинаковое количество черных узлов. Все листовые узлы черные. Вот некоторые приложения в реальном времени для структуры данных Красно-черное дерево: Большинство функций библиотек самобалансирующихся BST на C++ или Java используют Красно-черные деревья. Используется для реализации планирования процессора Linux. Также используется для снижения временной сложности в алгоритме кластеризации K-средних в машинном обучении. MySQL также использует Красно-черное дерево для индексов таблиц, чтобы сократить время поиска и вставки."
        },
        {
            "question": "Определите структуру данных Segment Tree и ее применения.",
            "right_answer": "Segment Tree - это бинарное дерево, которое используется для хранения интервалов или сегментов. Segment Tree состоит из узлов, представляющих интервалы. Segment Tree используется при наличии нескольких диапазонных запросов к массиву и изменениях элементов массива."
        },
        {
            "question": "В чем разница между PUSH и POP?",
            "right_answer": "С точки зрения вопросов на собеседовании по структурам данных, это один из самых часто задаваемых вопросов. Акронимы означают операции Pushing и Popping, выполняемые на стеке. Это способы хранения и извлечения данных. PUSH используется для добавления элемента в стек, в то время как POP используется для удаления элемента. PUSH принимает два аргумента: имя стека, в который нужно добавить данные, и значение записи, которое нужно добавить. POP нуждается только в имени стека. Когда стек заполнен и выполняется еще одна команда PUSH, возникает ошибка переполнения стека, что означает, что стек больше не может вместить последний PUSH. В POP возникает ошибка недостатка стека, когда вы пытаетесь POP пустой стек."
        },
        {
            "question": "В чем разница между NULL и VOID?",
            "right_answer": "Null - это значение, в то время как Void - это идентификатор типа данных. Null указывает на пустое значение для переменной, тогда как void указывает на указатели, у которых нет начального размера. Null означает, что его никогда не существовало; Void означает, что он существовал, но не действует."
        },
        {
            "question": "Что такое структура данных стек? Каковы применения стека?",
            "right_answer": "Стек - это структура данных, которая используется для представления состояния приложения в определенный момент времени. Стек состоит из серии элементов, которые добавляются в верхнюю часть стека, а затем удаляются с верхушки. Это линейная структура данных, которая следует определенному порядку выполнения операций. LIFO (Last In First Out) или FILO (First In Last Out) - два возможных порядка. Стек состоит из последовательности элементов. Элемент, добавленный последним, выйдет первым, реальный пример может быть стопка одежды одна на другой. Когда мы удаляем ткань, которая была ранее сверху, мы можем сказать, что ткань, добавленная последней, выходит первой. Ниже приведены некоторые применения структуры данных стек: Он действует как временное хранилище во время рекурсивных операций, Операции Повторить и Отменить в редакторах документов, Реверс строки, Соответствие скобок, Постфиксные к инфиксным выражениям, Порядок вызовов функций"
        },
        {
            "question": "Где можно использовать структуру данных стек?",
            "right_answer": "Вычисление выражений\nОткат\nУправление памятью\nВызов и возврат функций"
        },
        {
            "question": "Как работает сортировка выбором?",
            "right_answer": "Это один из самых часто задаваемых вопросов на собеседованиях по структурам данных. Сортировка выбором работает путем повторного выбора наименьшего числа в порядке возрастания из списка и размещения его в начале. Этот процесс повторяется, двигаясь к концу списка или отсортированного подмассива. Сканируем все элементы и находим наименьший. Переключаем его позицию как первый элемент. Повторяем сортировку выбором для оставшихся N-1 элементов. Мы всегда итерируем вперед (i от 0 до N-1) и меняем местами с наименьшим элементом (всегда i). Временная сложность: лучший случай O(n2); худший O(n2) Пространственная сложность: худший O(1)"
        },
        {
            "question": "Что такое асимптотические обозначения?",
            "right_answer": "Асимптотическая нотация представляет время выполнения алгоритма - сколько времени занимает алгоритм при заданном входе, n. Big O, большое Theta (), и большое Omega () - три различных обозначения. Когда время выполнения одинаково во всех случаях, используется big-, big-O для худшего случая времени выполнения, и big- для лучшего случая времени выполнения."
        },
        {
            "question": "Объясните разницу между линейной структурой данных и иерархической структурой данных",
            "right_answer": "Линейные структуры данных и иерархические структуры данных описывают отношения между элементами данных, но отличаются в том, как данные взаимодействуют. Линейные структуры данных организуют данные в одноуровневой последовательности. Иерархические структуры данных организуют данные в многоуровневой конфигурации."
        },
        {
            "question": "Что такое граф в структуре данных?",
            "right_answer": "Это тип нелинейной структуры данных, состоящий из вершин или узлов, соединенных ребрами или дугами для хранения или извлечения данных. Ребра могут быть направленными или ненаправленными."
        }
    ]
}