{
	"category_full_form": "Программист_Backend разработчик_Python_язык Python",
	"category_human_form": "Backend разработчик_Python",
	"category_filename_form": "программист_backend-разработчик_python_язык-python",
	"questions": [
		{
			"question": "Как в Python управляется память?",
			"right_answer": "Управление памятью в Python осуществляется частной кучей. Частная куча содержит все объекты Python и структуры данных. Эта куча недоступна программисту. Вместо этого об этом заботится интерпретатор Python. Python также включает в себя встроенный сборщик мусора, который перерабатывает всю неиспользуемую память и делает ее доступной для кучи. Управление памятью в Python отвечает за выделение кучи для объектов Python. Основной API позволяет программистам получить доступ к некоторым инструментам программирования."
		},
		{
			"question": "Как удалить файл в Python?",
			"right_answer": "Используйте команду os.remove(file_name) для удаления файла в Python."
		},
		{
			"question": "Что такое словарь в Python?",
			"right_answer": "Словарь - один из встроенных типов данных Python. Он устанавливает однозначное соответствие между ключами и значениями. Ключи и значения словаря хранятся парами в словарях. Ключи используются для индексации словарей."
		},
		{
			"question": "Что такое PIP?",
			"right_answer": "PIP обозначает Python Installer Package. Он используется для установки различных модулей Python. Это утилита командной строки, которая создает унифицированный интерфейс для установки различных модулей Python. Он ищет пакет в интернете и устанавливает его в рабочий каталог без необходимости какого-либо вмешательства пользователя."
		},
		{
			"question": "Что такое отрицательные индексы и зачем мы их используем?",
			"right_answer": "Последовательности в Python индексируются и включают как положительные, так и отрицательные значения. Положительные числа индексируются с '0' в качестве первого индекса и '1' в качестве второго индекса, и так далее. Индекс для отрицательного числа начинается с '-1', который является последним индексом в последовательности, и заканчивается на '-2', который является предпоследним индексом, и последовательность продолжается как с положительным числом. Отрицательный индекс используется для удаления всех новых пробелов из строки и позволяет ей принимать последний символ S[:-1]. Отрицательный индекс также может использоваться для представления правильного порядка строки."
		},
		{
			"question": "Каковы преимущества массивов NumPy по сравнению с (вложенными) списками Python?",
			"right_answer": "Списки в Python являются полезными контейнерами общего назначения. Они позволяют (относительно) быстро вставлять, удалять, добавлять и объединять элементы, а списковые включения Python делают их простыми в создании и использовании. У них есть некоторые ограничения: они не позволяют выполнять 'векторизованные' операции, такие как поэлементное сложение и умножение, и поскольку они могут содержать объекты разных типов, Python должен поддерживать информацию о типе для каждого элемента и выполнять код диспетчеризации типов при работе с ним. Массивы NumPy работают быстрее, и NumPy поставляется с рядом функций, включая гистограммы, алгебру, линейную алгебру, базовую статистику, быстрый поиск, свертки, БПФ и многое другое."
		},
		{
			"question": "Что такое функция Lambda?",
			"right_answer": "Функция lambda - это тип анонимной функции. Эта функция может принимать столько параметров, сколько вам нужно, но только один оператор."
		},
		{
			"question": "Каково использование self в Python?",
			"right_answer": "Self используется для представления экземпляра класса. В Python вы можете получить доступ к атрибутам и методам класса с помощью этого ключевого слова. Оно связывает атрибуты с аргументами. Self появляется в различных контекстах и часто ошибочно принимается за термин. Self не является ключевым словом в Python, в отличие от C++."
		},
		{
			"question": "Что такое модули Python? Назовите несколько встроенных модулей Python, которые часто используются.",
			"right_answer": "Модули Python - это файлы, содержащие код Python. В этом коде могут использоваться функции, классы или переменные. Модуль Python - это файл .py, содержащий код, который может быть выполнен. Вот несколько часто используемых встроенных модулей: JSON, data time, random, math, sys, OS"
		},
		{
			"question": "Что такое литералы в Python?",
			"right_answer": "Для примитивных типов данных литерал в исходном коде Python указывает на фиксированное значение."
		}
	]
}
