{
    "category_full_form": "Программист_Full Stack разработчик_Frontend часть_HTML + CSS",
    "category_human_form": "Full Stack разработчик_HTML + CSS",
    "category_filename_form": "программист_full-stack-разработчик_frontend-часть_html-css",
    "questions": [
        {
            "question": "Что такое SVG в HTML?",
            "right_answer": "HTML SVG используется для описания векторной или растровой графики. Изображения SVG и их поведение определяются в XML-файлах. Мы чаще всего используем его для векторных диаграмм, таких как круговые диаграммы, двумерные графики в системе координат X, Y."
        },
        {
            "question": "Что такое пустые элементы в HTML?",
            "right_answer": "Пустые элементы в HTML - это теги, которые не требуют закрывающего тега. Они используются для вставки изображений, переносов строк и другого контента, который не требует дополнительной информации."
        },
        {
            "question": "Что такое формы и как их создавать в HTML?",
            "right_answer": "Формы собирают данные пользователей, такие как информация для входа или поисковые запросы. Формы можно создавать с помощью тега <form>, а поля ввода, такие как текстовые поля и флажки, можно добавлять с помощью различных других тегов."
        },
        {
            "question": "Как вы разделяете раздел текста в HTML?",
            "right_answer": "Мы разделяем раздел текста в HTML, используя следующие теги: тег <br> - он используется для разделения строки текста. Он разрывает текущую строку и переносит поток текста на новую строку. Тег <p> - этот тег используется для написания абзаца текста. Тег <blockquote> - этот тег используется для определения больших цитируемых разделов."
        },
        {
            "question": "Как можно центрировать элемент по горизонтали и вертикали?",
            "right_answer": "Для центрирования элемента по горизонтали можно использовать margin: 0 auto; вместе с заданным шириной. Для центрирования элемента по вертикали можно использовать display: flex; вместе с align-items: centre; в контейнере."
        },
        {
            "question": "Что такое CSS?",
            "right_answer": "CSS расшифровывается как Каскадные таблицы стилей. Это язык таблиц стилей, используемый для описания внешнего вида и форматирования документа, написанного на HTML или XML."
        },
        {
            "question": "Как добавить JavaScript на веб-страницу HTML?",
            "right_answer": "JavaScript используется для создания интерактивных и удобных для пользователя веб-страниц. Это язык сценариев, который позволяет взаимодействовать с определенными элементами на странице на основе ввода пользователя. Как и с CSS, существуют три основных способа включения JavaScript: встроенный, блок скрипта и внешний файл JavaScript."
        },
        {
            "question": "Как обрабатывать события в HTML?",
            "right_answer": "События могут быть обработаны с помощью JavaScript, который может быть включен в HTML документ с использованием тега <script>. Слушатели событий могут быть добавлены к HTML элементам с использованием метода addEventListener(), который позволяет выполнять пользовательский код в ответ на действия пользователя, такие как клики или нажатия клавиш."
        },
        {
            "question": "Как можно вертикально выровнять текст внутри элемента?",
            "right_answer": "Вы можете вертикально выровнять текст, используя свойство vertical-align. Однако это применяется только к элементам inline или table-cell. Для элементов уровня блока вы можете использовать CSS flexbox или CSS grid для достижения вертикального выравнивания."
        },
        {
            "question": "Как изменить цвет текста с помощью CSS?",
            "right_answer": "Вы можете изменить цвет текста, используя свойство color в CSS. Например, color: red; сделает текст красным."
        },
        {
            "question": "Как можно выбрать элементы на основе их класса и идентификатора?",
            "right_answer": "Чтобы выбрать элементы на основе класса, вы добавляете префикс имени класса точкой (.) например .my-class. Чтобы выбрать элементы на основе идентификатора, вы добавляете префикс имени идентификатора решеткой (#) например #my-id."
        },
        {
            "question": "Что такое атрибут alt в HTML?",
            "right_answer": "Атрибут alt используется для отображения текста вместо изображения, когда изображение не может быть загружено из-за технической проблемы."
        },
        {
            "question": "Как создать ссылки на различные разделы на одной и той же веб-странице HTML?",
            "right_answer": "Мы используем тег <a>, а также ссылки с помощью символа #, чтобы создать несколько ссылок на различные разделы на одной и той же веб-странице."
        },
        {
            "question": "В чем разница между display: inline и display: inline-block?",
            "right_answer": "Свойство display: inline делает элемент похожим на элемент в строке, позволяя другим элементам появляться рядом на той же строке. display: inline-block также позволяет элементам появляться в строке, но сохраняет свойства блочного уровня, такие как установка ширины и высоты."
        },
        {
            "question": "Как вы бы отобразили данную таблицу на веб-странице HTML?",
            "right_answer": "<table>\n  <tr>\n    <td>50 шт</td>\n    <td>100</td>\n    <td>500</td>\n  </tr>\n  <tr>\n    <td>10 шт</td>\n    <td>5</td>\n    <td>50</td>\n  </tr>\n</table>"
        }
    ]
}