{
	"category_full_form": "Программист_Full Stack разработчик_Backend часть_Базы данных",
	"category_human_form": "Full Stack разработчик_Базы данных",
	"category_filename_form": "программист_full-stack-разработчик_backend-часть_базы-данных",
	"questions": [
		{
			"question": "В чем разница между кластерным и не кластерным индексом?",
			"right_answer": "Кластеризованный индекс изменяет таблицу и переупорядочивает способ хранения записей в таблице. Получение данных ускоряется с использованием кластеризованного индекса. Некластеризованный индекс не изменяет записи, хранящиеся в таблице, но создает совершенно другой объект внутри таблицы."
		},
		{
			"question": "Какие существуют типы отношений в базе данных? Определите их.",
			"right_answer": "Существует 3 типа отношений в базе данных: Один-к-одному, Один-ко-многим, Многие-ко-многим."
		},
		{
			"question": "Что вы понимаете под функциональной зависимостью?",
			"right_answer": "Отношение считается находящимся в функциональной зависимости, когда один атрибут уникально определяет другой атрибут."
		},
		{
			"question": "Что вы понимаете под Join?",
			"right_answer": "Join - это процесс определения отношений между различными таблицами путем объединения столбцов из одной или нескольких таблиц, имеющих общие значения в каждой. Когда таблица объединяется сама с собой, это называется Self Join."
		},
		{
			"question": "Что такое контрольная точка?",
			"right_answer": "Контрольная точка объявляет точку, до которой все журналы хранятся постоянно на диске хранения и находятся в несогласованном состоянии. В случае сбоев, количество работы и времени сохраняется, так как система может перезапуститься с контрольной точки."
		},
		{
			"question": "Определите курсор и его типы.",
			"right_answer": "Курсор - это временная рабочая область, которая хранит данные, а также набор результатов, возникших после манипуляции извлеченными данными. Курсор может содержать только одну строку. Существуют 2 типа курсоров: Неявные курсоры объявляются автоматически при выполнении операторов DML, таких как INSERT, UPDATE, DELETE. Явные курсоры должны быть объявлены при выполнении операторов SELECT, возвращающих более одной строки."
		},
		{
			"question": "Объясните Словарь данных.",
			"right_answer": "Словарь данных - это набор информации, описывающий содержание и структуру таблиц и объектов базы данных. Задача информации, хранящейся в словаре данных, заключается в контроле, манипуляции и доступе к отношениям между элементами базы данных."
		},
		{
			"question": "Что такое фантомная блокировка?",
			"right_answer": "Обнаружение фантомной блокировки - это состояние, когда блокировка на самом деле не существует, но из-за задержки в распространении локальной информации алгоритмы обнаружения блокировок идентифицируют блокировки."
		},
		{
			"question": "Определите блокировку базы данных и ее типы.",
			"right_answer": "Блокировка базы данных в основном означает транзакцию о текущем состоянии элемента данных, т.е. используется ли эти данные другими транзакциями в настоящий момент времени. Существуют два типа блокировки базы данных: Общая блокировка и Эксклюзивная блокировка."
		},
		{
			"question": "Объясните важность разделения баз данных.",
			"right_answer": "Важность разделения баз данных заключается в следующем: улучшает производительность запросов и управляемость. Упрощает общие административные задачи. Является ключевым инструментом для создания систем с крайне высокими требованиями к доступности. Позволяет получить доступ к большой части одного раздела."
		},
		{
			"question": "Как улучшить производительность запроса с помощью поиска индексов?",
			"right_answer": "Поиск индексов помогает улучшить производительность запроса путем:\n\nИспользования оптимизатора запросов для согласования запросов с рабочей нагрузкой.\nНаблюдения за производительностью и эффектом индекса и распределения запросов."
		},
		{
			"question": "Что такое SQL?",
			"right_answer": "Структурированный язык запросов, SQL - это стандартный язык программирования ANSI (American National Standard Institute), который специально разработан для хранения и управления данными в системе управления реляционными базами данных (RDBMS) с использованием всех видов операций с данными."
		},
		{
			"question": "Каковы преимущества и недостатки представлений в базе данных?",
			"right_answer": "Преимущества представлений: Поскольку нет физического местоположения, где хранятся данные в представлении, оно генерирует вывод, не тратя ресурсы. Доступ к данным ограничен, поскольку не позволяет выполнять команды вроде вставки, обновления и удаления. Недостатки представлений: Представление становится неактуальным, если мы удаляем таблицу, связанную с этим представлением. Много памяти занимается, когда создается представление для больших таблиц."
		},
		{
			"question": "Что вы понимаете под термином Index hunting?",
			"right_answer": "Index hunting - это процесс увеличения коллекции индексов, что помогает улучшить производительность запросов и скорость работы базы данных."
		}
	]
}
