{
    "category_full_form": "Программист_Frontend разработчик_Angular",
    "category_human_form": "Frontend разработчик_Angular",
    "category_filename_form": "программист_frontend-разработчик_angular",
    "questions": [
        {
            "question": "Что такое Angular? Зачем он был создан?",
            "right_answer": "Angular был создан для создания одностраничных приложений. Этот фреймворк приносит структуру и последовательность в веб-приложения и обеспечивает отличную масштабируемость и поддерживаемость."
        },
        {
            "question": "Что такое router links?",
            "right_answer": "Router links в Angular используются для навигации в приложении. Они определяются с помощью директивы routerLink и предоставляют способ навигации по различным маршрутам или компонентам. Router links могут использоваться в HTML-шаблонах и обычно размещаются на якорных (<a>) тегах или других элементах, по которым можно кликнуть. Указывая целевой маршрут или компонент, router links позволяют пользователям перемещаться между различными частями приложения Angular."
        },
        {
            "question": "Что такое Bootstrap? Как он встраивается в Angular?",
            "right_answer": "Bootstrap - это мощный инструментарий. Это набор инструментов HTML, CSS и JavaScript для создания и построения отзывчивых веб-страниц и веб-приложений. Существуют два способа встраивания библиотеки Bootstrap в ваше приложение: Angular Bootstrap через CDN и Angular Bootstrap через NPM."
        },
        {
            "question": "Объясните архитектуру MVVM.",
            "right_answer": "Архитектура MVVM - это архитектурный шаблон, используемый в основном в инженерии программного обеспечения. Он означает Model-View-ViewModel. MVVM является вариацией традиционного шаблона проектирования программного обеспечения MVC (Model-View-Controller). Основное различие между ними заключается в том, что MVVM разделяет логику пользовательского интерфейса от бизнес-логики, в то время как MVC разделяет логику доступа к данным от бизнес-логики. Это разделение обязанностей облегчает разработку, тестирование и поддержку программных приложений."
        },
        {
            "question": "Что такое Pipes в Angular?",
            "right_answer": "Пайпы (pipes) - это простые функции, предназначенные для принятия входного значения, обработки и возвращения в качестве выходного значения преобразованного значения в более техническом понимании. Angular поддерживает несколько встроенных пайпов. Однако вы также можете создавать пользовательские пайпы, которые соответствуют вашим потребностям."
        },
        {
            "question": "Что такое ngModule?",
            "right_answer": "NgModules - это контейнеры, которые резервируют блок кода для домена приложения или рабочего процесса. @NgModule принимает объект метаданных, который обычно описывает способ компиляции шаблона компонента и создания инжектора во время выполнения. Кроме того, он идентифицирует компоненты, директивы и каналы модуля, делая некоторые из них общедоступными через свойство экспорта, чтобы внешние компоненты могли их использовать."
        },
        {
            "question": "Как выбрать элемент из шаблона компонента?",
            "right_answer": "Вы можете использовать различные техники для выбора элемента из шаблона компонента в Angular. Один из распространенных подходов - использовать переменные ссылки на шаблон. Шаблон определяет эти переменные, используя символ #, за которым следует имя. Затем вы можете ссылаться на элемент, используя имя переменной в коде компонента. Другой подход - использовать директивы Angular, такие как ViewChild или ViewChildren, для запроса элементов на основе селекторов CSS или типов компонентов. Эти директивы обеспечивают большую гибкость и контроль при выборе элементов из шаблона компонента."
        },
        {
            "question": "Что вы понимаете под понятием scope в Angular?",
            "right_answer": "Scope в Angular связывает HTML, то есть вид, и JavaScript, то есть контроллер. Как и ожидалось, это объект с доступными методами и свойствами. Scope доступен как для вида, так и для контроллера. Когда вы создаете контроллер в Angular, вы передаете объект $scope в качестве аргумента."
        },
        {
            "question": "Что такое операторы шаблона?",
            "right_answer": "Операторы шаблона - это свойства или методы, используемые в HTML для реагирования на события пользователя. С помощью этих операторов шаблона приложение, которое вы создаете или работаете, может иметь возможность взаимодействовать с пользователями через действия, такие как отправка форм и отображение динамического контента."
        },
        {
            "question": "Укажите некоторые преимущества Angular.",
            "right_answer": "Некоторые из общих преимуществ Angular - архитектура MVC, модули, инъекция зависимостей, чистый и поддерживаемый код, модульное тестирование, повторное использование компонентов, привязка данных и отличный отзывчивый опыт."
        },
        {
            "question": "Как вы обрабатываете ошибки в observables?",
            "right_answer": "При работе с ошибками в observables в Angular можно использовать оператор catchError для обработки и восстановления после ошибок. Этот оператор позволяет вам предоставить запасное значение или выполнить альтернативную логику при возникновении ошибки. Вы можете цеплять оператор catchError после observable, который может вызвать ошибку, и определить функцию обратного вызова для обработки ошибки. Внутри функции обратного вызова вы можете выполнять задачи по обработке ошибок, такие как регистрация ошибки, отображение сообщения об ошибке пользователю или запуск механизма повторной попытки."
        },
        {
            "question": "Объясните хуки жизненного цикла в Angular",
            "right_answer": "В Angular у каждого компонента есть свой жизненный цикл. Angular создает и отображает эти компоненты, а также уничтожает их перед удалением из DOM. Это достигается с помощью хуков жизненного цикла."
        },
        {
            "question": "Что такое транспиляция в Angular?",
            "right_answer": "Транспиляция в Angular относится к процессу преобразования кода TypeScript в код JavaScript, который могут выполнять веб-браузеры."
        },
        {
            "question": "Что такое HTTP перехватчики?",
            "right_answer": "HTTP перехватчики в Angular - это функция, которая позволяет перехватывать HTTP запросы и ответы глобально. Перехватчики предоставляют возможность модифицировать или обрабатывать HTTP запросы и ответы в централизованном месте до их достижения сервера или клиента. Это может быть полезно для ведения журнала запросов, добавления заголовков аутентификации, обработки ошибок или изменения данных запроса/ответа. Перехватчики могут быть зарегистрированы в модуле Angular и выполняются в определенном порядке на основе конвейера запроса/ответа."
        },
        {
            "question": "Объясните компоненты, модули и сервисы в Angular.",
            "right_answer": "Компоненты, модули и сервисы - три основных строительных блока в Angular..."
        }
    ]
}