{
    "category_full_form": "Программист_Full Stack разработчик_Backend часть_C# + .NET Core",
    "category_human_form": "Full Stack разработчик_C# + .NET Core",
    "category_filename_form": "программист_full-stack-разработчик_backend-часть_c-net-core",
    "questions": [
        {
            "question": "Что произойдет, если имена методов в унаследованных интерфейсах конфликтуют?",
            "right_answer": "Проблема может возникнуть, когда методы из различных интерфейсов ожидают разные данные. Но когда речь идет о самом компиляторе, проблем не должно возникнуть."
        },
        {
            "question": "Что означает Частичный Класс?",
            "right_answer": "Частичный класс эффективно разбивает определение класса на различные классы в одном или других файлах исходного кода. Определение класса может быть написано в нескольких файлах, но оно компилируется как один класс во время выполнения, и когда класс формируется, все методы из всех исходных файлов могут быть доступны с использованием одного и того же объекта. Ключевое слово 'partial' обозначает это."
        },
        {
            "question": "Что такое интерфейсный класс?",
            "right_answer": "Интерфейсный класс - это абстрактный класс с только публичными абстрактными методами. В этих методах есть только объявление, но нет определения. Они должны быть реализованы в унаследованных классах."
        },
        {
            "question": "Что такое запечатанные классы в C#?",
            "right_answer": "Когда требуется наложить ограничение на класс, который должен быть унаследован, создаются запечатанные классы. Для предотвращения производных классов используется модификатор sealed. Ошибка времени компиляции возникает, когда запечатанный класс явно указывается как базовый класс."
        },
        {
            "question": "Что такое Thread Pooling в C#?",
            "right_answer": "В C# Thread Pool - это группа потоков. Эти потоки используются для выполнения работы без вмешательства в работу основного потока."
        },
        {
            "question": "Что означает Абстрактный Класс?",
            "right_answer": "Это тип класса, объекты которого нельзя создать, и он обозначается термином 'abstract'. Он состоит из методологии или одного подхода."
        },
        {
            "question": "Почему нельзя переопределить частный виртуальный метод в C#?",
            "right_answer": "Частные виртуальные методы не доступны за пределами класса."
        },
        {
            "question": "Укажите важные среды разработки для разработки на C#, предоставленные Microsoft.",
            "right_answer": "Следующие среды разработки полезны для разработки на C# - MonoDevelop, Visual Studio Code (VS Code), Browxy, Visual Studio Express (VSE), Visual Web Developer (VWD)"
        },
        {
            "question": "Что такое мультикастинг делегатов в C#?",
            "right_answer": "Мультикастинг делегатов позволяет пользователям указывать на более чем один метод в одном вызове."
        },
        {
            "question": "Что такое кортеж в C#?",
            "right_answer": "Кортеж - это структура данных, представляющая набор данных, который содержит несколько значений, которые могут быть связаны между собой."
        },
        {
            "question": "Перечислите наиболее часто используемые типы исключений в .NET",
            "right_answer": "Наиболее часто используемые типы исключений в .NET: ArgumentException, ArithmeticException, DivideByZeroException, OverflowException, InvalidCastException, InvalidOperationException, NullReferenceException, OutOfMemoryException, StackOverflowException"
        },
        {
            "question": "Назовите все модификаторы доступа в C#.",
            "right_answer": "Модификаторы доступа в C# - Private, Public, Internal, Protected"
        },
        {
            "question": "Что означает Неуправляемый или Управляемый код?",
            "right_answer": "Простыми словами, управляемый код - это код, который выполняется с помощью CLR (Common Language Runtime). Это означает, что вся код приложения полностью зависит от платформы .NET и считается управляемым в свете этого. Код, выполняемый программой времени выполнения, которая не является частью платформы .NET, считается неуправляемым кодом. Память, безопасность и другие действия, связанные с выполнением, будут обрабатываться временем выполнения приложения."
        },
        {
            "question": "Укажите все преимущества C#.",
            "right_answer": "Преимущества C# включают в себя то, что он ориентирован на компоненты, является объектно-ориентированным языком, синтаксис легко усваивается, его легче изучить, и C# является частью фреймворка под названием .NET"
        },
        {
            "question": "Что такое делегаты?",
            "right_answer": "Делегаты в основном то же самое, что и указатели на функции в C++. Основное и единственное различие между ними заключается в том, что делегаты безопасны по типу, в то время как указатели на функции - нет. Делегаты необходимы, потому что они позволяют создавать обобщенные функции, безопасные по типу."
        }
    ]
}