{
    "category_full_form": "Программист_Мобильный разработчик_Android_Java",
    "category_human_form": "Мобильный разработчик_Java",
    "category_filename_form": "программист_мобильный-разработчик_android_java",
    "questions": [
        {
            "question": "Что такое клонирование объектов?",
            "right_answer": "Способность создать объект, полностью аналогичный существующему объекту, известна как клонирование объектов в Java. Java предоставляет метод clone(), чтобы клонировать текущий объект, предоставляя ту же функциональность, что и оригинальный объект."
        },
        {
            "question": "Какие различия между конструктором и методом класса в Java?",
            "right_answer": "Инициализация состояния объекта выполняется конструкторами. Функция Object() { [native code] }, как и методы, содержит группу операторов (или инструкций), которые выполняются при создании объекта. Метод - это группа операторов, которые работают вместе для выполнения определенной задачи и возвращают результат вызывающему. Метод может работать и без возврата чего-либо."
        },
        {
            "question": "Почему функция удаления быстрее в связанном списке, чем в массиве?",
            "right_answer": "Функция удаления работает быстрее в связанных списках на Java, так как пользователю нужно сделать незначительное обновление значения указателя, чтобы узел мог указывать на следующий элемент в списке"
        },
        {
            "question": "Что такое shallow copy и deep copy в Java?",
            "right_answer": "В случае shallow copy копируются примитивные типы данных, в то время как в случае deep copy, помимо примитивных типов данных, также копируются ссылки на объекты."
        },
        {
            "question": "Что вы понимаете под экземплярной переменной и локальной переменной?",
            "right_answer": "Обычно экземплярные переменные объявляются в классе, но вне методов, в то время как локальная переменная объявляется внутри блоков кода."
        },
        {
            "question": "Что вы понимаете под инкапсуляцией данных?",
            "right_answer": "Инкапсуляция данных - одно из свойств концепций ООП, где все данные, такие как переменные и методы, объединены вместе как одно целое."
        },
        {
            "question": "В чем разница между переменными экземпляра и локальными переменными?",
            "right_answer": "Переменные экземпляра объявляются внутри класса, и область видимости переменных в javascript ограничена только определенным объектом. Локальная переменная может находиться в любом месте внутри метода или конкретного блока кода. Кроме того, область видимости ограничена сегментом кода, в котором переменная объявлена."
        },
        {
            "question": "Как мы можем установить область видимости бина Spring? И какие поддерживаемые области видимости у него есть?",
            "right_answer": "Существует четыре способа установить область видимости бина Spring: singleton, prototype, request и session."
        },
        {
            "question": "Можете ли вы объяснить жизненный цикл потока Java?",
            "right_answer": "Поток может находиться в любом из следующих состояний в Java. Это состояния: Новый, Активный, Заблокированный или Ожидающий, Временное ожидание, Завершение."
        },
        {
            "question": "Как исключения влияют на программу, если их не обрабатывать?",
            "right_answer": "Если вы не обрабатываете исключение после его возникновения, программа завершится внезапно, и код после строки, где произошло исключение, не будет выполнен."
        },
        {
            "question": "Объясните итератор FailFast и итератор FailSafe вместе с примерами для каждого.",
            "right_answer": "Итераторы FailFast не позволяют вносить изменения или модификации в коллекции Java, что означает, что они завершаются, когда в коллекцию добавляется последний элемент или удаляется существующий элемент. Итераторы FailFast обычно завершаются и генерируют исключение под названием ConcurrentModificationException. Примеры включают ArrayList и HashMap. С другой стороны, итераторы FailSafe позволяют вносить изменения или модификации в коллекции Java. Они работают с клонированной копией коллекции и не генерируют никакого конкретного исключения. Примером является CopyOnWriteArrayList."
        },
        {
            "question": "В чем разница между System.out, System.err и System.in?",
            "right_answer": "System.out и System.err по умолчанию представляют монитор и могут использоваться для отправки данных или результатов на монитор. System.out используется для отображения обычных сообщений и результатов. System.err используется для отображения сообщений об ошибках. System.in представляет объект InputStream, который по умолчанию представляет стандартное устройство ввода, т. е. клавиатуру."
        },
        {
            "question": "Как размер ArrayList динамически увеличивается? И также укажите, как он реализован внутренне?",
            "right_answer": "Используется изменяемая реализация массива в Java, называемая ArrayList. Динамическое расширение списков массивов позволяет добавлять новые элементы в любое время. Основная структура данных ArrayList - это массив класса Object. В классе ArrayList в Java есть три конструктора. Доступны методы readObject и writeObject, специфичные для него. Объектный массив в ArrayList является временным. Реализованы и сериализуемые версии RandomAccess, Cloneable и java.io (которые являются маркерным интерфейсом в Java)."
        },
        {
            "question": "Определите пакет в Java.",
            "right_answer": "Пакет - это совокупный набор классов и интерфейсов, а также необходимых библиотек и JAR-файлов. Использование пакетов помогает в повторном использовании кода."
        },
        {
            "question": "Можно ли реализовать указатели в программе на Java?",
            "right_answer": "Виртуальная машина Java автоматически управляет памятью. Основной девиз Java - сделать программирование простым. Поэтому прямой доступ к памяти через указатели не рекомендуется. Поэтому указатели исключены в Java."
        }
    ]
}