{
    "category_full_form": "Программист_Мобильный разработчик_Flutter",
    "category_human_form": "Мобильный разработчик_Flutter",
    "category_filename_form": "программист_мобильный-разработчик_flutter",
    "questions": [
        {
            "question": "Почему разработка приложения Flutter обычно занимает много времени?",
            "right_answer": "При первом построении приложения Flutter это занимает гораздо больше времени, чем обычно, так как Flutter создает файл IPA или APK, специфичный для устройства. В этом процессе используются Xcode и Gradle для создания файла, что обычно занимает много времени."
        },
        {
            "question": "Что такое await в Flutter? Напишите его использование",
            "right_answer": "До тех пор, пока асинхронный метод не завершится, await прерывает поток процесса. Await обычно означает: Подождите здесь, пока эта функция не завершится, чтобы вы могли получить ее возвращаемое значение. Await можно использовать только с async. Используя это, все текущие выполняющиеся функции приостанавливаются до завершения PF nature"
        },
        {
            "question": "Для чего используются Mixins?",
            "right_answer": "Множественное наследование не поддерживается в Dart. Поэтому нам нужны миксины для реализации множественного наследования в Flutter/Dart. Использование миксинов упрощает написание повторно используемого кода класса на разных уровнях иерархии классов. Миксины также могут использоваться для предоставления некоторых вспомогательных функций (например, RenderSliverHelpers в Flutter)."
        },
        {
            "question": "Когда использовать mainAxisAlignment и crossAxisAlignment?",
            "right_answer": "MainAxisAlignment - это то, как элементы выравниваются по этой оси, в то время как CrossAxisAlignment - это то, как элементы выравниваются по другой оси. Виджеты Row и Column могут выравнивать своих детей в соответствии с нашими предпочтениями, используя свойства crossAxisAlignment и mainAxisAlignment."
        },
        {
            "question": "Напишите разницу между SizedBox и Container.",
            "right_answer": "Container: В этом родительском виджете несколько дочерних виджетов могут быть легко контролированы и обрабатываться путем настройки их размера, отступов и цвета эффективно. Мы можем обернуть виджет в виджет контейнера, если ему нужен какой-либо стиль, например, цвет, форма или ограничение размера и т. д. SizedBox: Это конкретный размерный блок. В отличие от Container, он не позволяет устанавливать цвет или оформление виджета. В этом случае нам нужно только изменить размер виджета, который передается в качестве дочернего. Другими словами, он заставляет его дочерний виджет иметь определенный размер."
        },
        {
            "question": "Напишите разницу между runApp() и main() в Flutter.",
            "right_answer": "main(): Эта функция запускает программу. Flutter не позволяет нам написать программу без функции main(). runApp(): С помощью runApp() вы можете возвращать виджеты, которые связаны с экраном в качестве корня дерева виджетов, которое будет отображаться на экране. Эта функция вызывается в функции main, которая является драйвером приложения."
        },
        {
            "question": "Как мы можем создавать HTTP-запросы в Flutter?",
            "right_answer": "Для создания HTTP-запросов используйте пакет HTTP (import 'package:http/http.dart' as http;). Мы можем делать запросы следующим образом: http.get('https://jsonplaceholder.typicode.com/albums/1'); Это вернет Future <http.Response>."
        },
        {
            "question": "Назовите некоторые лучшие редакторы для разработки на Flutter.",
            "right_answer": "С помощью инструментов разработки Flutter разработчики могут ускорить процесс разработки Flutter и тем самым повысить свою продуктивность. Для разработки мобильных приложений требуются некоторые плагины для Flutter IDE и инструментов. С помощью этих плагинов мы можем компилировать Dart, анализировать код и разрабатывать Flutter. Вот некоторые популярные IDE для разработки на Flutter: Android Studio, Visual Studio, IntelliJ IDEA, Xcode, Eclipse, Emacs, Vim и т. д."
        },
        {
            "question": "Объясните состояние приложения.",
            "right_answer": "Состояние приложения также может называться общим состоянием или состоянием приложения. Возможно делиться состояниями приложения между разделами вашего приложения и поддерживать сеансы пользователей таким же образом. Вот некоторые примеры состояния приложения: информация о входе, предпочтения пользователя, корзина покупок электронной коммерции, уведомления социальных сетей и т. д."
        },
        {
            "question": "Что вы понимаете под нулевыми операторами?",
            "right_answer": "Нулевые операторы в Dart позволяют выполнять вычисления на основе того, является ли значение нулевым или нет. Dart предоставляет полезную информацию для обработки нулевых значений."
        },
        {
            "question": "Какие режимы сборки доступны в Flutter?",
            "right_answer": "Flutter состоит из трех режимов сборки: Режим отладки, Режим профилирования и Режим релиза."
        },
        {
            "question": "Для чего используется Ticker в Flutter?",
            "right_answer": "Мы используем тикер, чтобы определить, как часто обновляется наша анимация в Flutter. Сигналы отправляются с постоянной частотой, например, 60 раз в секунду, с использованием этого типа класса отправки сигналов. Мы лучше понимаем это с нашим часами, которые постоянно тикают. Для каждого тика предоставляется метод обратного вызова, который имеет время с момента первого тика на каждую секунду с момента его запуска. Тикеры синхронизируются немедленно, даже если они начинаются в разное время."
        },
        {
            "question": "Что такое Flutter Inspector?",
            "right_answer": "Точно так же, как и с нативным Android, файл XML позволяет нам просматривать чертеж и свойства нашего приложения. Существует мощный инструмент под названием Flutter Inspector для приложений Flutter, который позволяет визуализировать чертеж ваших виджетов и их свойства. Используя его, вы можете диагностировать различные проблемы макета и понять текущий макет. Flutter Inspector предлагает следующие преимущества: Выбор режима виджета, Переключение платформы, Показ базовых линий рисования, Показ отладочного рисования, Обновление виджета, Включение медленной анимации, Показать/скрыть наложение производительности."
        },
        {
            "question": "Что такое виджеты в Flutter?",
            "right_answer": "Приложения Flutter используют виджеты для написания мобильных приложений. Почти исключительно вы будете строить приложения на Flutter, используя виджеты. Виджеты определяют вид приложения. Когда вы изменяете код, код виджета автоматически корректируется. Виджеты вложены друг в друга, чтобы получить окончательный дизайн приложения. Это означает, что виджет является основой, на которой написано приложение."
        },
        {
            "question": "Объясните файл pubspec.yaml.",
            "right_answer": "Файл pubspec.yaml, также известный как 'pubspec', включается при создании проекта Flutter и находится в верхней части дерева проекта. Этот файл содержит информацию о зависимостях, таких как пакеты и их версии, шрифты и т. д., которые требуются для проекта. Он гарантирует, что при следующей сборке проекта вы получите ту же версию пакета. Кроме того, вы можете установить ограничения для приложения. Во время работы с проектом Flutter этот файл конфигурации проекта будет требоваться много. Эта спецификация написана на YAML, который может быть прочитан людьми. В этом файле содержатся: Общие настройки проекта, такие как название проекта, версия, описание и т. д. Зависимости в проекте. Активы проекта (например, изображения, аудио и т. д.)."
        }
    ]
}