{
    "category_full_form": "Программист_Мобильный разработчик_Xamarin (C#)",
    "category_human_form": "Мобильный разработчик_Xamarin (C#)",
    "category_filename_form": "программист_мобильный-разработчик_xamarin-c",
    "questions": [
        {
            "question": "Какие типы встроенных ячеек существуют?",
            "right_answer": "Типы встроенных ячеек: TextCell, ImageCell, SwitchCell, EntryCell."
        },
        {
            "question": "Укажите основные особенности C# кратко.",
            "right_answer": "Некоторые из основных особенностей C#:\n\nC# - это язык с безопасной типизацией и управляемый.\nC# ориентирован на объекты.\nC# - это дружелюбный кроссплатформенный язык.\nC# - это платформонезависимый язык при компиляции.\nC# - это общего назначения язык.\nC# используется для реализации деструкторов и конструкторов.\nC# является частью .NET-фреймворка.\nC# - это легкий в изучении и понимании язык.\nC# - это структурированный язык."
        },
        {
            "question": "Какие существуют типы режимов привязки данных в Xamarin?",
            "right_answer": "По умолчанию\nОдносторонняя: изменения в источнике влияют на цель\nДвусторонняя: изменения в источнике и назначении влияют друг на друга"
        },
        {
            "question": "В чем разница между операторами Break и Continue?",
            "right_answer": "Оператор Continue - используется для перехода к следующей итерации цикла, пропуская текущую. Оператор Break - используется для пропуска следующих операторов в текущей итерации и выхода из цикла."
        },
        {
            "question": "В чем разница между методами System.Array.CopyTo() и System.Array.Clone()?",
            "right_answer": "В методе Clone() создается новый объект массива со всеми оригинальными элементами массива, используя метод CopyTo(). По сути, все элементы, присутствующие в существующем массиве, копируются в другой существующий массив."
        },
        {
            "question": "Что такое паттерн Singleton в C#?",
            "right_answer": "Паттерн Singleton в C# имеет только один экземпляр, который обеспечивает глобальный доступ к нему."
        },
        {
            "question": "Что такое циклические ссылки?",
            "right_answer": "Когда два или более ресурса зависят друг от друга, это вызывает блокировку и ресурсы становятся непригодными к использованию. Это называется циклической ссылкой."
        },
        {
            "question": "Какие различные виды страниц присутствуют в Xamarin.Forms?",
            "right_answer": "Различные типы страниц в Xamarin.Forms: Страница содержимого, Страница MasterDetail, Страница навигации, Вкладки страницы, Шаблонная страница и Карусельная страница."
        },
        {
            "question": "Что такое виртуальный метод в C#?",
            "right_answer": "В родительском классе объявляется виртуальный метод, который может быть переопределен в дочернем классе. Мы создаем виртуальный метод в базовом классе, используя ключевое слово virtual, и этот метод переопределяется в производном классе с помощью ключевого слова Override."
        },
        {
            "question": "Назовите приложения, разработанные Xamarin для iOS?",
            "right_answer": "Приложения, разработанные Xamarin для iOS: QuickPLan- Project Plan HD, NewsPager, Apocalyspe Archer: Zombie invasion, Stone Skimmer: Skimming action game"
        },
        {
            "question": "Что такое мультикастинг делегатов в C#?",
            "right_answer": "Мультикастинг делегатов позволяет пользователям указывать на более чем один метод в одном вызове."
        },
        {
            "question": "Является ли код C# управляемым или неуправляемым кодом?",
            "right_answer": "C# является управляемым кодом, так как среда выполнения общего языка может компилировать код C# в промежуточный язык."
        },
        {
            "question": "Обсудите различные методы передачи параметров в методе.",
            "right_answer": "Различные методы передачи параметров в методе включают - параметры вывода, параметры значения, параметры ссылки."
        },
        {
            "question": "Какие различия между классами System.String и System.Text.StringBuilder?",
            "right_answer": "System.String является неизменным. Когда значение переменной строки изменяется, новая память выделяется для нового значения. Предыдущее выделение памяти освобождается. System.StringBuilder, с другой стороны, разработан так, чтобы иметь изменяемую строку, в которой может быть выполнено множество операций без необходимости выделения отдельного места в памяти для измененной строки."
        },
        {
            "question": "Что такое гонка в C#?",
            "right_answer": "Когда 2 потока получают доступ к одному и тому же ресурсу и пытаются изменить его одновременно, у нас возникает гонка."
        }
    ]
}