{
    "category_full_form": "Программист_Специалист по кибербезопасности",
    "category_human_form": "Специалист по кибербезопасности",
    "category_filename_form": "программист_специалист-по-кибербезопасности",
    "questions": [
        {
            "question": "Что такое Фишинг? Приведите пример.",
            "right_answer": "Фишинг: Кибератака, при которой злоумышленники используют обманные электронные письма или сообщения, чтобы обмануть людей и заставить их раскрывать чувствительную информацию. Пример: Электронное письмо, утверждающее, что оно отправлено от банка, с просьбой получателю предоставить свои учетные данные, перейдя по ссылке, ведущей на фальшивый веб-сайт."
        },
        {
            "question": "Что такое уязвимость нулевого дня?",
            "right_answer": "Это относится к уязвимости безопасности, присутствующей в программном обеспечении или оборудовании, которая не разглашается поставщику и не имеет существующего решения. Эту лазейку могут использовать злоумышленники до создания средства защиты."
        },
        {
            "question": "В чем разница между шифрованием и хешированием?",
            "right_answer": "И шифрование, и хеширование используются для преобразования читаемых данных в неразборчивый формат. Разница заключается в том, что зашифрованные данные могут быть преобразованы обратно в исходные данные с помощью процесса дешифрования, в то время как хешированные данные не могут быть преобразованы обратно в исходные данные."
        },
        {
            "question": "Что такое traceroute? Зачем он используется?",
            "right_answer": "Traceroute - это инструмент, который показывает путь пакета. Он перечисляет все точки (в основном маршрутизаторы), через которые проходит пакет. Это используется в основном, когда пакет не достигает своего пункта назначения. Traceroute используется для проверки, где прерывается или обрывается соединение, чтобы определить точку отказа."
        },
        {
            "question": "Обсудите будущие тенденции в кибербезопасности.",
            "right_answer": "Тенденции включают в себя использование искусственного интеллекта и машинного обучения для обнаружения угроз, архитектуру нулевого доверия, облачную безопасность и увеличенное внимание к безопасности интернета вещей и 5G."
        },
        {
            "question": "Что такое Security Operations Center (SOC)?",
            "right_answer": "SOC - это централизованная команда, ответственная за мониторинг в реальном времени, обнаружение и реагирование на инциденты безопасности."
        },
        {
            "question": "Обсудите важность планирования восстановления после катастрофы в кибербезопасности.",
            "right_answer": "Планирование восстановления после катастрофы включает в себя проактивную подготовку и реагирующие действия, необходимые для защиты от потери данных или сбоев системы, в конечном итоге обеспечивая бесперебойную работу бизнеса."
        },
        {
            "question": "Объясните разницу между Угрозой, Уязвимостью и Риском в кибербезопасности.",
            "right_answer": "Угроза: Любая потенциальная опасность или вредное событие, которое может использовать уязвимости и негативно сказываться на безопасности. Уязвимость: Слабые места или пробелы в мерах безопасности, которые могут использовать угрозы. Риск: Вероятность того, что угроза воспользуется уязвимостью и потенциальные последствия или ущерб, который она может причинить."
        },
        {
            "question": "Как вы подходите к обеспечению безопасности большой распределенной сети?",
            "right_answer": "Используйте сегментацию, сильные контроли доступа, регулярные аудиты и мониторинг сети для защиты от угроз по всей обширной сети."
        },
        {
            "question": "Какие коды ответа могут быть получены от веб-приложения?",
            "right_answer": "1xx – Информационные ответы\n2xx – Успех\n3xx – Перенаправление\n4xx – Ошибка со стороны клиента\n5xx – Ошибка со стороны сервера"
        },
        {
            "question": "Что такое аудит безопасности?",
            "right_answer": "Аудит безопасности систематически оценивает информационные системы и политику безопасности организации для оценки их эффективности, выявления уязвимостей и рекомендации улучшений."
        },
        {
            "question": "Определите термины Вирус, Вредоносное ПО и Вымогательство выкупа.",
            "right_answer": "Вирус: Программа, которая воспроизводится и распространяется на другие файлы или системы, часто нанося вред. Вредоносное ПО: Более широкий термин, охватывающий любое вредоносное программное обеспечение, нарушающее или получающее несанкционированный доступ к компьютерным системам. Вымогательство выкупа: Вредоносное программное обеспечение, шифрующее файлы или компьютерные системы и требующее выкуп за их расшифровку."
        },
        {
            "question": "Что такое многофакторная аутентификация и как она повышает безопасность?",
            "right_answer": "МФА укрепляет безопасность, требуя от пользователей предоставить несколько факторов аутентификации, обычно комбинацию чего-то, что они имеют (например, мобильный токен) и чего-то, что они знают (например, пароль)."
        },
        {
            "question": "Объясните понятие Advanced Persistent Threats (APT).",
            "right_answer": "APT - это долгосрочные, целенаправленные кибератаки опытных противников. Они используют скрытность, настойчивость и сложные техники для взлома систем."
        },
        {
            "question": "Объясните концепцию угрозовой разведки и ее применение.",
            "right_answer": "Угрозовая разведка - это сбор и анализ данных для выявления и реагирования на новые угрозы, обеспечивая проактивную кибербезопасность."
        }
    ]
}