{
    "category_full_form": "Программист_Backend разработчик_Базы данных_Общие вопросы",
    "category_human_form": "Backend разработчик_Базы данных",
    "category_filename_form": "программист_backend-разработчик_базы-данных_общие-вопросы",
    "questions": [
        {
            "question": "Что такое фантомная блокировка?",
            "right_answer": "Обнаружение фантомной блокировки - это состояние, когда блокировка на самом деле не существует, но из-за задержки в распространении локальной информации алгоритмы обнаружения блокировок идентифицируют блокировки."
        },
        {
            "question": "Какие существуют типы отношений в базе данных? Определите их.",
            "right_answer": "Существует 3 типа отношений в базе данных: Один-к-одному, Один-ко-многим, Многие-ко-многим."
        },
        {
            "question": "Каковы преимущества и недостатки представлений в базе данных?",
            "right_answer": "Преимущества представлений: Поскольку нет физического местоположения, где хранятся данные в представлении, оно генерирует вывод, не тратя ресурсы. Доступ к данным ограничен, поскольку не позволяет выполнять команды вроде вставки, обновления и удаления. Недостатки представлений: Представление становится неактуальным, если мы удаляем таблицу, связанную с этим представлением. При создании представления для больших таблиц занимается много места в памяти."
        },
        {
            "question": "Что такое RDBMS?",
            "right_answer": "Система управления реляционными базами данных (RDBMS) основана на реляционной модели данных, которая хранится в базах данных в отдельных таблицах и связана с использованием общего столбца. Данные могут быть легко получены из реляционной базы данных с использованием языка структурированных запросов (SQL)."
        },
        {
            "question": "Что вы понимаете под триггерами базы данных?",
            "right_answer": "Набор команд, которые автоматически выполняются при наступлении события, такого как Before Insert, After Insert, On Update, On Delete строки в таблице, называется триггером базы данных."
        },
        {
            "question": "Что такое VDL и SDL?",
            "right_answer": "VDL - это Язык Определения Представлений, который представляет представления пользователей и их сопоставление с концептуальной схемой. SDL - это Язык Определения Хранилища, который определяет сопоставление между двумя схемами."
        },
        {
            "question": "Определите отношение между 'Представлением' и 'Независимостью данных'.",
            "right_answer": "Представление - это виртуальная таблица, у которой нет своих данных, а данные определяются из одной или нескольких базовых таблиц. Представления обеспечивают логическую независимость данных, поскольку рост и реструктуризация базовых таблиц не отражаются в представлениях."
        },
        {
            "question": "Сколько SQL операторов используется? Определите их.",
            "right_answer": "Операторы SQL в основном делятся на три категории: DDL, DML и DCL."
        },
        {
            "question": "Что такое Хранилище данных?",
            "right_answer": "Хранение и доступ к данным, полученным из транзакций и других источников, из центрального места для проведения анализа, называется Хранилищем данных."
        },
        {
            "question": "Что такое хранимые процедуры?",
            "right_answer": "Хранимая процедура - это набор предварительно скомпилированных SQL-запросов, которые при выполнении обозначают программу, принимающую ввод, обрабатывающую его и выдающую результат."
        },
        {
            "question": "Перечислите некоторые команды DDL, DML и DCL.",
            "right_answer": "Команды языка определения данных (DDL): CREATE, ALTER, TRUNCATE, DROP, RENAME. Команды языка манипулирования данными (DML): INSERT, UPDATE, DELETE, MERGE. Команды языка управления данными (DCL): COMMIT, ROLLBACK, SAVEPOINT."
        },
        {
            "question": "Что такое DML Compiler?",
            "right_answer": "Компилятор DML переводит операторы DML на языке запросов в инструкции низкого уровня, и сгенерированная инструкция может быть понята Query Evaluation Engine."
        },
        {
            "question": "Что вы понимаете под 'База данных'?",
            "right_answer": "База данных - это организованная коллекция связанных данных, где данные хранятся и организованы для выполнения определенной цели."
        },
        {
            "question": "Что такое DBMS?",
            "right_answer": "DBMS означает Система управления базами данных. Это набор прикладных программ, которые позволяют пользователю организовывать, восстанавливать и извлекать информацию о данных эффективно и максимально эффективно. Некоторые из популярных DBMS: MySql, Oracle, Sybase и т. д."
        },
        {
            "question": "Что вы понимаете под избыточностью данных?",
            "right_answer": "Дублирование данных в базе данных известно как избыточность данных. В результате избыточности данных дублированные данные присутствуют в нескольких местах, что приводит к потере места для хранения и нарушению целостности базы данных."
        }
    ]
}