{
	"category_full_form": "Программист_Backend разработчик_Разработка API_GraphQL",
	"category_human_form": "Backend разработчик_GraphQL",
	"category_filename_form": "программист_backend-разработчик_разработка-api_graphql",
	"questions": [
		{
			"question": "Что такое GraphQL?",
			"right_answer": "GraphQL - это как язык запросов, так и серверная среда выполнения для API, которая позволяет клиентам запрашивать именно те данные, которые им нужны. В отличие от традиционных REST API, которые могут возвращать больше информации, чем вам нужно, GraphQL предлагает способ взаимодействия с службами данных, который предотвращает избыточное или недостаточное извлечение данных. Веб- и мобильные приложения часто используют GraphQL для улучшения извлечения и манипулирования данными, используя его серверную среду выполнения для разрешения запросов."
		},
		{
			"question": "Что такое batching в GraphQL и как это влияет на производительность?",
			"right_answer": "Batching в GraphQL относится к процессу объединения нескольких запросов или мутаций в один HTTP-запрос, что уменьшает количество сетевых обращений. Этот подход может значительно улучшить производительность, минимизируя задержку и накладные расходы, связанные с выполнением нескольких отдельных запросов, особенно в сценариях с несколькими одновременными требованиями к данным. Однако для эффективного разрешения этих пакетных запросов без перегрузки системы требуется тщательное управление со стороны сервера; инструменты, такие как DataLoader, могут помочь."
		},
		{
			"question": "Как можно оптимизировать запросы GraphQL для повышения производительности, особенно при работе с глубоко вложенными данными?",
			"right_answer": "Для оптимизации запросов GraphQL для повышения производительности используйте ограничение глубины запроса и анализ сложности, чтобы избежать дорогостоящих операций с базой данных. Также следует использовать эффективные техники загрузки данных, такие как пакетная обработка и кэширование на уровне извлечения данных, чтобы снизить нагрузку на базу данных. Кроме того, рассмотрите возможность реализации механизма сохраненных запросов, который будет хранить и эффективно извлекать часто используемые или дорогостоящие запросы. Этот подход уменьшит необходимость в разборе и проверке запросов при каждом запросе."
		},
		{
			"question": "Каковы преимущества и недостатки GraphQL?",
			"right_answer": "GraphQL имеет преимущества в эффективном извлечении данных, настраиваемых запросах клиентов и строго типизированной схеме, которая упрощает исследование и проверку API. Но по сравнению с традиционными REST API его недостатки включают более крутой кривой обучения, потенциально интенсивную обработку на стороне сервера и сложную оптимизацию запросов. Кроме того, запросы GraphQL динамичны, что может сделать кэширование более сложным."
		},
		{
			"question": "Как вы будете защищать GraphQL API от распространенных уязвимостей безопасности, таких как SQL-инъекции или DDoS-атаки?",
			"right_answer": "Для защиты GraphQL API от SQL-инъекций используйте параметризованные запросы или подготовленные операторы в операциях с базой данных, а также тщательно проверяйте и очищайте все вводы пользователей. Для защиты от DDoS-атак реализуйте ограничение скорости, анализ сложности запросов и ограничение глубины для контроля нагрузки на ваш сервер. В качестве дополнительной меры используйте системы мониторинга и брандмауэры веб-приложений (WAF), чтобы выявлять и реагировать на подозрительный трафик или действия."
		},
		{
			"question": "Что такое восклицательный знак в GraphQL?",
			"right_answer": "В GraphQL восклицательный знак (!) указывает на то, что поле в запросе или аргумент поля не может быть пустым. Это означает, что поле должно содержать значение и не может быть пустым. Когда он используется с полем, это гарантирует, что сервер всегда возвращает значение, которое не является нулевым. Когда он используется с аргументом поля, это указывает на то, что клиент должен предоставить аргумент и не может его пропустить."
		},
		{
			"question": "Как вы обрабатываете и сообщаете об ошибках в рабочем GraphQL API?",
			"right_answer": "Ошибки в рабочем GraphQL API обрабатываются путем отправки дружелюбных сообщений об ошибках клиенту и их регистрации в системе мониторинга для анализа и оповещения. Чувствительные данные исключаются из соображений безопасности, но критические детали контекста ошибки, такие как запрос, переменные и информация о пользователе, регистрируются для целей отладки. Кроме того, операционные ошибки отличаются от ошибок разработчика, чтобы помочь в стратегиях реагирования и устранения проблем."
		},
		{
			"question": "Что такое резолверы в GraphQL?",
			"right_answer": "В GraphQL каждое поле схемы соответствует функции, известной как резолвер. Резолвер возвращает значение для данного поля в операции. Резолверы предоставляют инструкции о том, как вычислить или извлечь данные с сервера или других источников. Они являются важной частью реализации серверов GraphQL, потому что они переводят поля в схеме в реальные источники данных, которые могут быть базами данных, REST API или другими службами."
		},
		{
			"question": "Как вы обрабатываете ошибки в GraphQL?",
			"right_answer": "Вместо использования традиционных кодов состояния HTTP, ошибки возвращаются в ответе наряду с данными. Эти ошибки могут быть сгенерированы сервером GraphQL (для ошибок синтаксиса или валидации), а также резолверами (для ошибок бизнес-логики или времени выполнения). Затем клиенты могут анализировать эти ошибки и обрабатывать их соответственно, часто используя сообщение об ошибке и дополнительные поля, такие как коды ошибок или пути, чтобы определить характер и местоположение ошибки."
		},
		{
			"question": "Что такое схема GraphQL?",
			"right_answer": "Схема GraphQL описывает возможности сервера GraphQL, определяя список типов и директив. Она описывает типы данных, которые могут быть запрошены и изменены, отношения между этими типами, а также запросы и мутации, которые доступны. Схема действует как контракт, который определяет, какую информацию клиент может запросить и как сервер будет отвечать."
		},
		{
			"question": "Как можно создать пользовательские директивы в GraphQL и какие у них могут быть применения?",
			"right_answer": "Пользовательские директивы в GraphQL могут быть определены в языке схемы и реализованы на стороне сервера, обычно в конфигурации сервера GraphQL. Эти директивы могут использоваться для изменения способа выполнения запросов или мутаций; например, они могут использоваться для выполнения трансформаций на уровне поля, обеспечения разрешений или реализации пользовательской бизнес-логики. Некоторые применения включают в себя логирование, аутентификацию, устаревание полей и динамическое изменение ответов на запросы на основе определенных условий или ролей пользователей."
		},
		{
			"question": "Как осуществляется аутентификация и авторизация в GraphQL?",
			"right_answer": "Аутентификация обычно обрабатывается за пределами уровня GraphQL, обычно через HTTP-заголовки, такие как JSON Web Tokens (JWT). Авторизация реализуется в резолверах GraphQL путем проверки разрешений перед возвратом данных или выполнением мутаций. Аутентификация проверяет личность пользователя, в то время как авторизация определяет их права доступа к различным частям схемы GraphQL."
		},
		{
			"question": "Какие меры безопасности и bewt практики следует учитывать при открытии GraphQL API для общественного доступа?",
			"right_answer": "Для открытия GraphQL API для общественного доступа необходимо использовать надежные процедуры аутентификации и авторизации, валидацию и санитаризацию ввода, а также ограничения сложности и глубины запросов. Важно также использовать мониторинг API и техники ограничения скорости, чтобы выявлять и прекращать злоупотребление трафиком. Кроме того, следует обеспечить безопасность схемы GraphQL и не раскрывать чувствительные данные в сообщениях об ошибках, чтобы защититься от утечки информации и потенциальной эксплуатации."
		},
		{
			"question": "Как можно реализовать версионирование в GraphQL API, не нарушая работу существующих клиентов?",
			"right_answer": "Разработчики GraphQL могут успешно реализовать версионирование API, используя расширение схемы, которое позволяет им добавлять или изменять поля и типы без воздействия на существующие или удаления их. Этот подход, известный как «эволюционное» или «непрерывное» версионирование, позволяет клиентам продолжать использовать исходную схему, в то время как новые клиенты используют расширенную схему. Разработчики также могут сохранить обратную совместимость, устаревая устаревшие поля, а не удаляя их, и используя псевдонимы полей для основных изменений."
		},
		{
			"question": "Какие основные концепции языка запросов GraphQL?",
			"right_answer": "Основные концепции языка запросов GraphQL крутятся вокруг его схемно-ориентированного подхода. GraphQL определяет типы и отношения в схеме, позволяя клиентам запрашивать именно те данные, которые им нужны, используя запросы. Мутации позволяют клиентам изменять данные, а поля указывают, какие данные извлекать. Аргументы, псевдонимы и фрагменты улучшают гибкость запросов, а переменные делают запросы динамичными. Директивы предлагают условное выполнение, а интроспекция позволяет клиентам исследовать структуру и возможности схемы, делая GraphQL мощным и универсальным языком запросов."
		}
	]
}
