{
	"category_full_form": "Программист_Аналитик данных_Базы данных",
	"category_human_form": "Аналитик данных_Базы данных",
	"category_filename_form": "программист_аналитик-данных_базы-данных",
	"questions": [
		{
			"question": "Объясните концепции первичного ключа и внешнего ключа.",
			"right_answer": "Первичный ключ используется для уникальной идентификации записей в таблице базы данных, в то время как внешний ключ в основном используется для связи двух или более таблиц между собой, поскольку это конкретное поле(поля) в одной из таблиц базы данных, которые являются первичным ключом для другой таблицы."
		},
		{
			"question": "Какие правила целостности существуют в СУБД?",
			"right_answer": "Существует два основных правила целостности в СУБД. Целостность сущности: это утверждает очень важное правило, что значение первичного ключа никогда не может иметь значение NULL. Ссылочная целостность: это правило связано с внешним ключом, которое утверждает, что значение внешнего ключа либо является значением NULL, либо должно быть первичным ключом в другой связи."
		},
		{
			"question": "Что такое SQL подзапрос и как он используется?",
			"right_answer": "SQL подзапрос, также известный как вложенный запрос или внутренний запрос, является запросом, вложенным в другой SQL запрос. Это мощная функция SQL, которая позволяет извлекать данные из одной или нескольких таблиц на основе результатов другого запроса. Подзапросы используются для различных целей, таких как фильтрация, сортировка или выполнение вычислений над подмножеством данных в более крупном наборе данных."
		},
		{
			"question": "Что такое Live Lock?",
			"right_answer": "Ситуацию livelock можно определить как когда два или более процесса постоянно повторяют одно и то же взаимодействие в ответ на изменения в других процессах, не выполняя никакой полезной работы. Эти процессы не находятся в состоянии ожидания и выполняются параллельно. Это отличается от тупика, потому что в тупике все процессы находятся в состоянии ожидания."
		},
		{
			"question": "Какие существуют различные типы объединений в SQL?",
			"right_answer": "Существует 4 типа объединений в SQL: Inner Join, Left Join, Right Join, Full Join."
		},
		{
			"question": "Что такое первичный ключ и почему он важен?",
			"right_answer": "Первичный ключ (PK) в реляционной базе данных - это специальный столбец или набор столбцов, который уникально идентифицирует каждую строку (запись) в таблице. Он служит средством обеспечения целостности данных, обеспечения уникальности и установления отношений между таблицами."
		},
		{
			"question": "Какие существуют различные типы отношений в СУБД?",
			"right_answer": "Отношение в СУБД отображает ассоциацию между таблицами. Различные типы отношений: Один-к-Один, Один-ко-Многим, Многие-к-Многим."
		},
		{
			"question": "Что такое 1NF в СУБД?",
			"right_answer": "1NF известна как Первая Нормальная Форма. Это самая простая форма процесса нормализации, которая утверждает, что домен атрибута должен содержать только атомарные значения. Цель этого - удалить дублирующиеся столбцы, присутствующие в таблице."
		},
		{
			"question": "Как фильтровать результаты на основе нескольких условий, используя операторы AND и OR?",
			"right_answer": "Чтобы фильтровать результаты на основе нескольких условий, используя операторы AND и OR в SQL, вы можете использовать оператор WHERE вместе с этими операторами, чтобы указать критерии, которым должны соответствовать строки, включаемые в набор результатов. Эти операторы позволяют создавать сложные условия путем объединения нескольких логических выражений. SELECT * FROM employees WHERE (department = 'Sales' AND salary > 50000) OR department = 'Marketing';"
		},
		{
			"question": "Что такое INNER JOIN и как он работает?",
			"right_answer": "INNER JOIN - это тип операции объединения SQL, который объединяет строки из двух или более таблиц на основе указанного условия и возвращает только те строки, для которых условие истинно. Другими словами, INNER JOIN извлекает соответствующие записи из обеих таблиц, исключая несоответствующие записи."
		},
		{
			"question": "В чем разница между первичным ключом и уникальными ограничениями?",
			"right_answer": "Первичный ключ не может иметь значение NULL, уникальные ограничения могут иметь значения NULL. В таблице может быть только один первичный ключ, но может быть несколько уникальных ограничений."
		},
		{
			"question": "Что такое индексы?",
			"right_answer": "Индекс базы данных - это структура данных, которая улучшает скорость операций поиска данных в таблице базы данных за счет дополнительных записей и использования дополнительного пространства для хранения дополнительной копии данных. Данные могут храниться только в одном порядке на диске. Для обеспечения более быстрого доступа к различным значениям, таких как бинарный поиск для различных значений, создаются индексы на таблицах. Эти индексы требуют дополнительного места на диске, но позволяют более быстрый поиск по различным часто запрашиваемым значениям."
		},
		{
			"question": "Объясните различные типы сбоев, которые возникают в базе данных Oracle.",
			"right_answer": "Типы сбоев - В базе данных Oracle могут возникать следующие типы сбоев: Сбой оператора, Неверный тип данных, Недостаточное пространство, Недостаточные привилегии (например, привилегии объекта для роли), Сбой процесса пользователя, Ошибка пользователя, Сбой экземпляра, Сбой носителя, Журналы предупреждений."
		},
		{
			"question": "Что такое внешний ключ и как он используется в SQL?",
			"right_answer": "Внешний ключ (FK) в SQL - это столбец или набор столбцов в таблице, который устанавливает связь между данными в двух таблицах. Он определяет отношение между таблицей, содержащей внешний ключ, и другой таблицей, обычно называемой 'родительской' или 'ссылочной' таблицей. Внешние ключи используются для обеспечения ссылочной целостности, поддержания согласованности данных и установления отношений между таблицами в реляционной базе данных."
		},
		{
			"question": "Что такое LIMIT clause и когда его используют?",
			"right_answer": "LIMIT clause - это SQL-команда, используемая для ограничения количества строк, возвращаемых оператором SELECT. Он позволяет указать максимальное количество строк, которые должны быть включены в набор результатов. LIMIT clause особенно полезен для ограничения объема данных, извлекаемых из большой таблицы, или для реализации пагинации в веб-приложениях."
		}
	]
}
