{
    "category_full_form": "Программист_Backend разработчик_Базы данных_PostgreSQL",
    "category_human_form": "Backend разработчик_PostgreSQL",
    "category_filename_form": "программист_backend-разработчик_базы-данных_postgresql",
    "questions": [
        {
            "question": "Совместим ли PostgreSQL с облаком?",
            "right_answer": "Да, PostgreSQL совместим и может быть запущен в облаке. PostgreSQL является очень переносимым. Более того, подобно другим базам данных с открытым исходным кодом, PostgreSQL может легко выполняться в виртуальных контейнерах."
        },
        {
            "question": "Какой язык запросов является основным для PostgreSQL?",
            "right_answer": "SQL или язык структурированных запросов является основным языком запросов PostgreSQL."
        },
        {
            "question": "Перечислите недостатки PostgreSQL.",
            "right_answer": "Несмотря на множество преимуществ, у PostgreSQL есть много недостатков. Некоторые из них включают: PostgreSQL может иметь более медленную скорость по сравнению с MySQL. Он поддерживает меньше открытых приложений по сравнению с MySQL. Распознаваемость на рынке для PostgreSQL была вызовом из-за отсутствия конкретного владельца. Его производительность может быть ниже, чем у MySQL в определенных ситуациях."
        },
        {
            "question": "Какова цель утилиты pg_archivecleanup в PostgreSQL?",
            "right_answer": "Основная цель инструмента pg_archivecleanup в PostgreSQL - избавиться от файлов WAL (Write Ahead Logging) из каталога. Это гарантирует, что будут сохранены только необходимые файлы WAL, необходимые для восстановления в определенный момент времени (PITR)."
        },
        {
            "question": "Какое полное значение ORDBMS?",
            "right_answer": "Полное значение ORDBMS - это Система управления базами данных объектно-реляционной модели."
        },
        {
            "question": "Какие типы данных используются в PostgreSQL?",
            "right_answer": "В PostgreSQL используются следующие типы данных:-\nЧисловой тип данных (Integer, Float)\nГеометрические примитивы\nЛогический тип данных\nТип данных символов (varchar, char, text)\nДенежный тип данных\nМассив\nТип данных документа (JSON, XML, Key-value, и т. д.)\nДата/Время тип данных\nТип данных настраиваемый (Композитный, пользовательские типы и т. д.)"
        },
        {
            "question": "Опишите кратко историю PostgreSQL.",
            "right_answer": "PostgreSQL возник как важная часть проекта POSTGRES, инициированного профессором Майклом Стоунбрейкером в 1986 году в Университете Калифорнии, Беркли. Он совместим с основными операционными системами, такими как macOS, Windows, Linux и UNIX. PostgreSQL поддерживает свойства ACID с 2001 года, с непрерывным развитием ядра платформы на протяжении более трех десятилетий. Он включает значительные дополнения, такие как расширение базы данных PostGIS, и стал стандартной базой данных для macOS, обычно известной как Postgres, благодаря широкому распространению стандарта SQL среди реляционных баз данных."
        },
        {
            "question": "Опишите метод, с помощью которого можно изменить тип данных столбца в PostgreSQL.",
            "right_answer": "Тип данных одного или нескольких столбцов в PostgreSQL можно изменить, используя следующие команды вместе с ключевым словом TYPE: ALTER TABLE, ALTER COLUMN. Пример: ALTER TABLE tab_name ALTER COLUMN col_name TYPE new_data_type;"
        },
        {
            "question": "Объясните разделение таблиц в PostgreSQL.",
            "right_answer": "Разделение таблиц в PostgreSQL - это процесс, при котором большая таблица разбивается на более мелкие части. Эти более мелкие части называются разделами. PostgreSQL поддерживает разделение по списку и диапазону через свою функцию наследования таблиц. Разделение таблиц помогает увеличить производительность запросов в PostgreSQL, так как гораздо проще выбирать данные из этих разделов, чем выбирать из одной основной таблицы. Каждый раздел может хранить данные в соответствии с частотой их использования, что позволяет хранить малоиспользуемые данные на носителях, которые могут быть медленнее или дешевле."
        },
        {
            "question": "Каковы преимущества логической репликации по сравнению с методами физической репликации?",
            "right_answer": "Преимущества логической репликации: В логической репликации возможно селективное копирование, что делает ее более гибкой для выбора данных для репликации. Физическая репликация требует идентичных версий PostgreSQL на обоих основных серверах и резервных серверах, в то время как логическая репликация может работать с разными версиями PostgreSQL. Логическая репликация предлагает большую гибкость по сравнению с физической репликацией в обработке изменений в схеме. Логическая репликация совместима с несколькими приложениями и задачами по обслуживанию базы данных."
        },
        {
            "question": "Какое полное значение MVCC?",
            "right_answer": "Полное значение MVCC - это многоверсионный контроль одновременности."
        },
        {
            "question": "Укажите максимальный размер таблицы в PostgreSQL.",
            "right_answer": "Максимальное количество блоков в таблице определяет предел таблицы. Поскольку количество блоков составляет 2^32, а размер блока по умолчанию равен 8192 байтам, следовательно, максимальный размер таблицы в PostgreSQL составляет 32 ТБ."
        },
        {
            "question": "Что вы понимаете под командой enable-debug в PostgreSQL?",
            "right_answer": "Команда enable-debug в PostgreSQL - это команда, которая помогает компилировать все библиотеки и приложения. Она содержит несколько символов отладки, которые облегчают поиск ошибок и других проблем, которые могут возникнуть во время выполнения скрипта. Этот процесс может замедлить или затруднить работу системы при использовании, увеличивая размер двоичного файла."
        },
        {
            "question": "В чем разница между кластеризованными и не кластеризованными индексами?",
            "right_answer": "Кластеризованный индекс: Он быстрее, чем не кластеризованный индекс. Индекс считается основными данными в кластеризованном индексе. Кластеризованный индекс имеет возможность естественно хранить данные на диске. Он требует меньше памяти для операций по сравнению с не кластеризованным индексом. В таблице может быть только один кластеризованный индекс. Не кластеризованный индекс: Он относительно медленнее по сравнению с кластеризованным индексом. В случае не кластеризованного индекса, индекс является копией данных. Не кластеризованный индекс не может естественно хранить данные на диске. Не кластеризованный индекс требует больше памяти для выполнения операций. В таблице может быть несколько не кластеризованных индексов."
        },
        {
            "question": "Как можно решить конфликты репликации в PostgreSQL?",
            "right_answer": "Когда изменения данных происходят одновременно в разных местах, таких как мульти, что может привести к конфликтам репликации, программное обеспечение автоматически гарантирует, что изменение, которое должно быть разрешено, с помощью «обработчиков конфликтов» в PostgreSQL. Эти обработчики конфликтов автоматически разрешают применимые изменения, чтобы избежать конфликтов."
        }
    ]
}