{
	"category_full_form": "Программист_DevOps инженер_Работа с базами данных",
	"category_human_form": "DevOps инженер_Работа с базами данных",
	"category_filename_form": "программист_devops-инженер_работа-с-базами-данных",
	"questions": [
		{
			"question": "Объясните Нормализацию и Денормализацию.",
			"right_answer": "Нормализация - это процесс удаления избыточных данных из базы данных путем разделения таблицы в хорошо определенном порядке для поддержания целостности данных. Этот процесс экономит много места для хранения. Денормализация - это процесс добавления избыточных данных в таблицу для ускорения выполнения сложных запросов и, таким образом, достижения лучшей производительности."
		},
		{
			"question": "Что такое RDBMS?",
			"right_answer": "Система управления реляционными базами данных (RDBMS) основана на реляционной модели данных, которая хранится в базах данных в отдельных таблицах и связана с использованием общего столбца. Данные могут быть легко получены из реляционной базы данных с использованием языка структурированных запросов (SQL)."
		},
		{
			"question": "Объясните Словарь данных.",
			"right_answer": "Словарь данных - это набор информации, описывающий содержание и структуру таблиц и объектов базы данных. Задача информации, хранящейся в словаре данных, заключается в управлении, манипулировании и доступе к отношениям между элементами базы данных."
		},
		{
			"question": "Перечислите некоторые команды DDL, DML и DCL.",
			"right_answer": "Команды языка определения данных (DDL): CREATE, ALTER, TRUNCATE, DROP, RENAME. Команды языка манипулирования данными (DML): INSERT, UPDATE, DELETE, MERGE. Команды языка управления данными (DCL): COMMIT, ROLLBACK, SAVEPOINT."
		},
		{
			"question": "Что такое хранилище данных?",
			"right_answer": "Хранение и доступ к данным, полученным из транзакций и других источников, из центрального места для проведения анализа, называется хранилищем данных."
		},
		{
			"question": "Когда функциональная зависимость считается полностью функционально зависимой?",
			"right_answer": "Для того чтобы соответствовать критериям полной функциональной зависимости, отношение должно удовлетворять требованию функциональной зависимости. Функциональная зависимость 'A' и 'B' считается полностью функционально зависимой, когда удаление любого атрибута, скажем 'X', из 'A' означает, что зависимость больше не существует."
		},
		{
			"question": "Что такое фантомная блокировка?",
			"right_answer": "Обнаружение фантомной блокировки - это состояние, когда блокировка на самом деле не существует, но из-за задержки в распространении локальной информации алгоритмы обнаружения блокировок идентифицируют блокировки."
		},
		{
			"question": "Что такое разделение баз данных?",
			"right_answer": "Разделение баз данных - это процесс разделения таблиц, индексов на более мелкие части для управления и доступа к данным на более тонком уровне. Этот процесс разделения снижает стоимость хранения большого объема данных, а также улучшает производительность и управляемость."
		},
		{
			"question": "Что такое SQL?",
			"right_answer": "Структурированный язык запросов, SQL - это стандартный язык программирования ANSI (American National Standard Institute), который специально разработан для хранения и управления данными в системе управления реляционными базами данных (RDBMS) с использованием всех видов операций с данными."
		},
		{
			"question": "Объясните Первичный ключ и Составной ключ.",
			"right_answer": "Первичный ключ - это столбец таблицы, данные каждой строки которого уникально идентифицируются. В каждой строке таблицы должен быть первичный ключ, и ни две строки не могут иметь одинаковый первичный ключ. Значение первичного ключа никогда не может быть пустым или изменено. Составной ключ - это форма кандидатского ключа, где набор столбцов уникально идентифицирует каждую строку в таблице."
		},
		{
			"question": "Что вы понимаете под B-деревьями?",
			"right_answer": "B-дерево представляет структуру данных в виде дерева для внешней памяти, которая читает и записывает большие блоки данных. Оно часто используется в базах данных и файловых системах, где все операции вставки, удаления, сортировки и т. д. выполняются за логарифмическое время."
		},
		{
			"question": "Что такое хранимые процедуры?",
			"right_answer": "Хранимая процедура - это набор предварительно скомпилированных SQL-запросов, которые при выполнении обозначают программу, принимающую ввод, обрабатывающую и выдающую вывод."
		},
		{
			"question": "Определите курсор и его типы.",
			"right_answer": "Курсор - это временная рабочая область, которая хранит данные, а также набор результатов, возникших после манипуляции извлеченными данными. Курсор может содержать только одну строку. Существуют 2 типа курсоров: Неявные курсоры объявляются автоматически при выполнении операторов DML, таких как INSERT, UPDATE, DELETE. Явные курсоры должны быть объявлены при выполнении операторов SELECT, возвращающих более одной строки."
		},
		{
			"question": "Что такое VDL и SDL?",
			"right_answer": "VDL - это Язык Определения Представлений, который представляет представления пользователей и их сопоставление с концептуальной схемой. SDL - это Язык Определения Хранилища, который определяет сопоставление между двумя схемами."
		}
	]
}
