{
	"category_full_form": "Программист_Разработчик игр_Графическое программирование_Общие вопросы",
	"category_human_form": "Разработчик игр_Графическое программирование",
	"category_filename_form": "программист_разработчик-игр_графическое-программирование_общие-вопросы",
	"questions": [
		{
			"question": "Что такое Растеризация?",
			"right_answer": "Фаза определения подходящих пикселей для представления изображений или графических объектов называется растеризацией."
		},
		{
			"question": "Что такое разрешение?",
			"right_answer": "Максимальное количество точек, которые могут быть представлены без перекрытия на кинескопе, называется разрешением. Разрешение - это количество точек на сантиметр, которые могут быть построены поперек и вертикально, хотя оно устанавливается как общее количество точек в каждом направлении."
		},
		{
			"question": "Что такое программа Turtle Graphics?",
			"right_answer": "Графика черепахи - это процедура в компьютерной графике для программирования векторной графики с использованием относительного курсора на декартовой плоскости. Графика черепахи является важной характеристикой языка программирования Logo."
		},
		{
			"question": "Перечислите некоторые устройства для просмотра 3D.",
			"right_answer": "Стереоскопические системы\nСистемы виртуальной реальности"
		},
		{
			"question": "Что такое фракталы?",
			"right_answer": "Фракталы - это те, у которых есть свойство формы, которая имеет одинаковую степень шероховатости независимо от того, насколько ее увеличивать. Фрактал выглядит одинаково на каждом масштабе."
		},
		{
			"question": "Что такое трансляция?",
			"right_answer": "Трансляция используется для перемещения объекта с одной координатной точки на другую вдоль прямой линии."
		},
		{
			"question": "Каково основное применение компьютерной графики?",
			"right_answer": "Компьютерная графика используется в компьютерном проектировании, создании иллюстраций для документов, генерации слайдов для презентаций, создании 3D-моделей и в индустрии развлечений."
		},
		{
			"question": "Что такое преобразование просмотра?",
			"right_answer": "Отображение компонента сцены в мировых координатах в устройственные координаты называется преобразованием просмотра."
		},
		{
			"question": "Что такое сдвиг?",
			"right_answer": "Преобразование, которое искажает форму объекта таким образом, что преобразованный способ развивается так, как если бы объект состоял из внутренних слоев, которые были вызваны для скольжения друг по другу, известен как сдвиг."
		},
		{
			"question": "Перечислите различные свойства, описывающие характеристики света.",
			"right_answer": "Отражение\nПреломление\nДисперсия\nИнтерференция\nДифракция"
		},
		{
			"question": "Что такое Clipping и Clip window?",
			"right_answer": "Любой метод, который определяет те части изображения, которые находятся внутри или снаружи определенной области пространства, называется алгоритмом обрезки или просто обрезкой. Область, по отношению к которой объект обрезается, называется окном обрезки."
		},
		{
			"question": "Что такое системы ключевых кадров?",
			"right_answer": "Системы ключевых кадров - это специализированные языки анимации, предназначенные для генерации промежуточных кадров из заданных пользователем ключевых кадров. Каждый объект в сцене описывается как набор жестких тел, соединенных в сочленениях и с ограниченным числом степеней свободы. Промежуточные кадры генерируются из спецификации двух или более ключевых кадров. Движение объекта может быть описано кинематически как набор сплайновых кривых или физически, указывая силу, действующую на анимируемый объект."
		}
	]
}
